[{"content": "This is an excellent account of how the competitive dynamics are shifting in Lyft's favor in its ride-sharing battle with Uber. Unfortunately, the analysis of the impact of autonomous cars is shallow. It notes that autonomous vehicles can be \"can be utilized nearly 100% of the time.\" Yet one of the key drivers of the peer-to-peer model is that it pulls in part time workers to address inherently lumpy demand. To have enough autonomous cars to meet peak demand, you have to have way more cars than you need. (I talk about the tradeoffs, and how to properly understand how autonomy intersects with the on-demand business model as one of the many subjects in my forthcoming book WTF: What's the Future and Why It's Up to Us.) Nonetheless, this is a must-read article on this game changing technology. Some particularly good thoughts from John Zimmer of Lyft on why autonomous vehicles will still create opportunity for human workers.", "title": "This is an excellent account of how the competitive dynamics are shifting in Lyft's favor in its ride..."}, {"content": "Billionaire Nick Hanauer has some blistering advice for his fellow plutocrats on the left. If you want to do something about Trump, don't \"#resist\", pay ordinary people more of the extraordinary gains brought to the economy by rising productivity.He writes \"Many of my peers prefer to hide behind the enduring myth that today’s crisis of economic inequality and insecurity is the result of forces unleashed by unstoppable trends in technology and globalization. “It’s not my fault I have so much while others have so little,” we comfort ourselves, “it’s the economy.” That is nonsense. There’s no intrinsic reason why the social and political changes delivered by technological advances and globalization have to massively concentrate wealth in the hands of the few. We simply exploited changing circumstances to take advantage of people with less power than us.\"", "title": "Billionaire Nick Hanauer has some blistering advice for his fellow plutocrats on the left. If you want..."}, {"content": "Cheryl Platz, former senior UX designer on Amazon's Alexa platform team, recently spoke with O'Reilly Media editor Nikki McDonald for the O'Reilly Design podcast about the challenges of working on a top-secret design project, gender bias in the market for home devices, the research behind Amazon's Echo Look, the skills required to start designing for voice, and how studying improv can make you a better designer. ", "title": "Cheryl Platz, former senior UX designer on Amazon's Alexa platform team, recently spoke with O'Reilly..."}, {"content": "Brett Goldstein gives some excellent advice on basic security hygiene. It the most obvious cure for the common risks of the connected world. ", "title": "Brett Goldstein gives some excellent advice on basic security hygiene. It the most obvious cure for ..."}, {"content": "A couple of weeks ago, I sat down with New York Times senior editor Charles Duhigg at the Aspen Ideas Festival for a discussion of my book, WTF? What's the Future and Why It's Up to Us, and how my examination of today's algorithmically managed technology platforms led me also to question our financial system, which incentivizes companies to use technology to eliminate jobs rather than using it to enable humans to do things that were previously impossible.Technology eliminates jobs because that's what we are asking it to do, not because it is somehow an intrinsic property of technology itself. Technology is the solution to problems, and there's plenty still to do.P.S. Charles is a master at getting the audience involved. (We had a discussion with Steve Case, among others.)", "title": "A couple of weeks ago, I sat down with New York Times senior editor Charles Duhigg at the Aspen Ideas..."}, {"content": "Carl Malamud explains that his crusade to make law and public safety codes free to the public online is an act of Gandhian satyagraha (insistence on truth, and persistence in pursuit of it, as a form of non-violent resistance)  o", "title": "Carl Malamud explains that his crusade to make law and public safety codes free to the public online..."}, {"content": "There are many directions this article could have gone - the difference in platform philosophy between Google and Apple, for example, or data vs. design as key competitive advantage. Instead, it goes in an even more interesting direction: whether it's better for founders to call the tune, or public market investors. If you have been following other things I've written about financialization, you know which side of that debate I come down on. The author is right: how this issue gets decided has huge impact on the shape of our economy! ", "title": "There are many directions this article could have gone - the difference in platform philosophy between..."}, {"content": "Worried about predictive policing? This profile of Civicscape and its co-founder Brett Goldstein will help you understand the complexities, and how at least one team is using open source to let others see inside the black box that trains the algorithms. ", "title": "Worried about predictive policing? This profile of Civicscape and its co-founder Brett Goldstein will..."}, {"content": "Read this brilliant pitch from Rob Reid about why Medium should become the new home for book authors. He's syndicating a significant part of his upcoming near-term science fiction novel there, plus a podcast explaining the science and tech behind it. This could be a breakthrough in publishing.", "title": "Read this brilliant pitch from Rob Reid about why Medium should become the new home for book authors..."}, {"content": "There's no better illustration of how the US has lost world leadership than when Chinese investors and entrepreneurs explain to the US how to put technology in service of humanity rather than the prosperity of a few. In this week's issue of the Next:Economy newsletter: Sinovation Ventures' CEO Kai-Fu Li and Alibaba CEO Jack Ma school the US on its wasted opportunity and how we must confront the challenges of the future. ", "title": "There's no better illustration of how the US has lost world leadership than when Chinese investors and..."}, {"content": "If you live in New York, and you're not familiar with this book (and its followup, Secret New York: Curious Activities), you are missing a treat!  ", "title": "If you live in New York, and you're not familiar with this book (and its followup, Secret New York: ..."}, {"content": "O'Reilly Media President Laura Baldwin explains the business rationale behind our decision to close our online shop at oreilly.com (despite the fact that it still generated millions of dollars of revenue) in order to focus all our efforts on growing our subscription business at Safari. She also explains that O'Reilly DRM-free ebooks are available from other online resellers. ", "title": "O'Reilly Media President Laura Baldwin explains the business rationale behind our decision to close ..."}, {"content": "As Jason Tanz of Wired, who urged me to write this piece, summarized its argument: \"Uber was the product of a brilliant but amoral industry. It can remake itself, and tech too.\" This article tells the story of what went wrong at Uber in the context of the incentives that increasingly drive the tech industry and our entire economy. We have to change those incentives, or management changes at Uber will just be window dressing. (I talk more about all this in my forthcoming book, WTF: What's the Future and Why It's Up to Us.)", "title": "As Jason Tanz of Wired, who urged me to write this piece, summarized its argument: \"Uber was the product..."}, {"content": "If there is only one article about the NBA finals that you read, make it this one. And if you have no interest in the NBA, read it anyway. It is a testament to the intelligence, work ethic, strategic focus, and teamwork that make a champion. There are lessons here for everyone. ", "title": "If there is only one article about the NBA finals that you read, make it this one. And if you have no..."}, {"content": "This made me laugh out loud. One thing Trump has been good for is the rise of colorful commentary! \"An investigation into Trumpworld for collusion...could morph into the equivalent of looking for bacteria on a pile of dung. Large parts of the overpriced real estate sector involve money laundering, with Russian, Chinese, Arab and even Iranian money.\" The article has many good insights, not as colorful, but equally sharp. ", "title": "This made me laugh out loud. One thing Trump has been good for is the rise of colorful commentary! \"..."}, {"content": "America’s class privilege runs much deeper than the “1%\". We need to get rid of cherished middle class programs for a fairer deal. An interesting perspective from a Brit on how America is in denial about the way that it makes sure the well off stay that way. Well worth reading.", "title": "America’s class privilege runs much deeper than the “1%\". We need to get rid of cherished middle class..."}, {"content": "This is what you get when you believe that “government should just get out of the way” and let industry do its thing. When will get over the failed idea that good government is an obstacle to progress? We do best when government, business, and all of society work together towards shared goals. ", "title": "This is what you get when you believe that “government should just get out of the way” and let industry..."}, {"content": "I wish I’d written this! It's the best explanation I've seen of how to think through the possible impact of inventions. (Although I disagree with Ben about the impact of voice interfaces. They don't have to be able to do everything to be transformative.)  http://ben-evans.com/benedictevans/2017/5/24/not-even-wrong-ways-to-dismiss-technology", "title": "I wish I’d written this! It's the best explanation I've seen of how to think through the possible impact..."}, {"content": "Bryce Roberts is doing an amazing job cutting through the hype and making clear the distinction between lifestyle businesses, venture-backed businesses done right, and customer-driven businesses in the \"real economy\" of goods and services. This is a must-read for anyone considering launching a business.\"If your pitch deck has an 'exit strategy' slide you are pitching a lifestyle business.... Real businesses make products and sell them for a profit. They focus on customers, revenue and profitability not investors, valuations and the next fundable milestone. Real businesses prioritize their customer’s needs over their customer’s eyeballs. They have a functioning business model, not a believable financial model. Real businesses want to stay in business, not run for the exit. They create their own source of funding and don’t have to ask anyone for permission to exist. We believe real businesses make really great investments.\" ", "title": "Bryce Roberts is doing an amazing job cutting through the hype and making clear the distinction between..."}, {"content": "I had wondered what was the underlying truth being distorted in Trump's claims. This NYT article does a good job of explaining fairly the truth about NATO's funding. ", "title": "I had wondered what was the underlying truth being distorted in Trump's claims. This NYT article does..."}, {"content": "I'm really glad to see blame being put where it belongs: \"When an unlucky passenger was violently dragged off a full United Airlines flight in Chicago in April, setting off a public-relations nightmare for the company, the blame naturally fell on the cabin crew, the police and eventually airline executives. But ultimately, the episode was set in motion elsewhere — on Wall Street.\"", "title": "I'm really glad to see blame being put where it belongs: \"When an unlucky passenger was violently dragged..."}, {"content": "Earlier this week, while I was in the UK, I was interviewed by @TPPodcast_ about tech, politics, and the economy. I talk about why corporate efficiency - doing the same thing with fewer people to improve corporate profits - is a dead end. Great companies use the increased productivity brought by technology to DO MORE. Amazon is a great example of efficiency done right. I also talk about the equivalent of \"fake news\" in financial markets and the startup world. ", "title": "Earlier this week, while I was in the UK, I was interviewed by @TPPodcast_ about tech, politics, and..."}, {"content": "I'm totally stoked to hear that computational biologist and open science advocate (UC Berkeley professor and co-founder of Public Library of Science) Michael Eisen is running for the US Senate, now tweeting as @SenatorPhD, with the tag line: “Liberty, Equality, Reality”. We could use some of that.", "title": "I'm totally stoked to hear that computational biologist and open science advocate (UC Berkeley professor..."}, {"content": "This is a good summary of one of those fresh ideas that will change the way you see the world and think about the future. The ending is particularly provocative. ", "title": "This is a good summary of one of those fresh ideas that will change the way you see the world and think..."}, {"content": "This is really great news. \"In the Occidental vote, the world’s largest asset manager, BlackRock, for the first time bucked management to vote in favor of a climate-risk resolution.... Even more striking, shareholder support is moving in the opposite direction from Washington policy.\" ", "title": "This is really great news. \"In the Occidental vote, the world’s largest asset manager, BlackRock, for..."}, {"content": "Why do we treat assessments as “grades”? I'm proud that our team at +O'Reilly is providing self-assessment! I've always wanted this - tools to help people understand how to learn better, rather than for someone else to rate them. Thanks +Paco Nathan for leading this effort! ", "title": "Why do we treat assessments as “grades”? I'm proud that our team at +O'Reilly is providing self-assessment..."}, {"content": "I'm so impressed with what Reid Hoffman and June Cohen have done with the #MastersOfScale podcast, so I jumped at June's offer to write a response to the second episode. I completely love what they have done. I'm astonished at the richness of the storytelling and the production.  It's the This American Life of the tech world. So even though I point out a gap in Reid's argument about why you should always take more money from investors than you think you need, I can't hope to compete by providing a response that is only in print. Still, I hope that you'll listen to the original, read about my own experiences as a bootstrapped entrepreneur, and think about the wide range of opportunities to make your business better. There is so much to learn, and Reid's podcast is perfectly designed to teach you. Each episode is focused on one key lesson, which is illustrated through the stories of real entrepreneurs.", "title": "I'm so impressed with what Reid Hoffman and June Cohen have done with the #MastersOfScale podcast, so..."}, {"content": "I love new sources of trend data about technology adoption. We've used variations of this for years at O'Reilly, with data from job postings, book sales, website popularity, downloads from archive sites, mailing list postings, github data, and more. But here's some great data now available from Stack Overflow ", "title": "I love new sources of trend data about technology adoption. We've used variations of this for years ..."}, {"content": "So happy to see Code for America alum company Remix getting so much traction and a new round of funding! ", "title": "So happy to see Code for America alum company Remix getting so much traction and a new round of funding..."}, {"content": "The best thing about waitbutwhy’s story about Neuralink, Elon Musk's Brain-Machine Interface company, is the explanation of how  Musk thinks about business strategy as a way of catalyzing new industries. This is really long, but worth it. If necessary, skip the early bits to get to the meat. ", "title": "The best thing about waitbutwhy’s story about Neuralink, Elon Musk's Brain-Machine Interface company..."}, {"content": "Here's an advance tidbit from tomorrow's Next:Economy newsletter. Sign up now to get the newsletter, complete with links to this fascinating research: \"By now we’ve all heard about the types of jobs that are threatened by automation. But there's a geographic aspect to job displacement. New research by the Institute for Spatial Economic Analysis (ISEA) at the University of Redlands finds that low-wage US metropolitan areas—such as Las Vegas and Orlando—will be hardest-hit by automation [link]. This piece [link] from Business Insider contrasts the map of job displacement with another map showing that automation will have a smaller impact on areas with higher-paying jobs, while this analysis in CityLab [link] highlights the prospects for greater political divides caused by the growing income gap between low-wage and high-wage regions.\"  ", "title": "Here's an advance tidbit from tomorrow's Next:Economy newsletter. Sign up now to get the newsletter,..."}, {"content": "I learned a lot from this analysis of the characteristics of high-performing CEOs, and how boards often go wrong in what they select for (charisma, education, singular past success.) In one sense, it is nothing new, but it offers great opportunities for self-reflection to anyone in a leadership position. Keys: decisiveness (better to be wrong and fix it than to dither), engaging employees around a shared vision, proactive adaptation (and anticipation of) changing conditions, and reliability (or more properly, consistency). ", "title": "I learned a lot from this analysis of the characteristics of high-performing CEOs, and how boards often..."}, {"content": "I’ve been eagerly awaiting the public release of Steve Ballmer’s USAFacts project, and now it’s here. Andrew Ross Sorkin gives a great overview, but also be sure to check out the site itself (which is linked in Sorkin's NYT profile of the project below).I particularly like the way the project aligns government spending with the \"mission statement\" of the country as expressed in the preamble to the constitution. I also like the way that it combines Federal, State, and Local, based on the insight that we should be looking at government services from a user-centered point of view, not from the structure of who provides them.", "title": "I’ve been eagerly awaiting the public release of Steve Ballmer’s USAFacts project, and now it’s here..."}, {"content": "This sequence of tweets from Dan Hon about the algorithmic fiasco at United is hilarious and insightful. Read the whole thread. ", "title": "This sequence of tweets from Dan Hon about the algorithmic fiasco at United is hilarious and insightful..."}, {"content": "This is an excellent piece on continuous delivery and business transformation at IBM, and the relationship between tools, vision, and culture. \"The magic is in the new, better practices that the tools enable. A tool is a vehicle for practices. Practices directly shape habits and tacit assumptions. Habits and tacit assumptions are the foundations of culture.\" (Also nice for the shoutout to O'Reilly's Safari online learning platform along with tools like Github and Slack.) ", "title": "This is an excellent piece on continuous delivery and business transformation at IBM, and the relationship..."}, {"content": "This is the best piece I've read yet on the post-truth world, tongue-in-cheek yet full of truths to be teased out. Its central argument reminds me a bit of both Carlota Perez's book Technological Revolutions and Financial Capital crossed with Yuval Noah Harari's Sapiens. For more of Andrew Odlyzko's writing on the history of bubbles in technological and social advancement, see http://www.dtc.umn.edu/~odlyzko/doc/bubbles.html.", "title": "This is the best piece I've read yet on the post-truth world, tongue-in-cheek yet full of truths to ..."}, {"content": "Mark Cuban's tweet about data science in the NBA, featuring the image of his screen and an O'Reilly Media book, is on our home page. Mark has a data science team at the Mavs, but he still likes to get his own hands dirty! He's using Data Science with Python to do better with basketball.A leader from the front. https://www.oreilly.com", "title": "Mark Cuban's tweet about data science in the NBA, featuring the image of his screen and an O'Reilly ..."}, {"content": "This is truly shameful. The DRM world has truly gone wild when a farmer is unable to fix his own equipment. This is where \"Do It Yourself\" is about as core to the American ethos as you get. As the Make: magazine slogan say, \"If you can't open it, you don't own it.\" ", "title": "This is truly shameful. The DRM world has truly gone wild when a farmer is unable to fix his own equipment..."}, {"content": "Predictive policing has enormous risks of introducing algorithmic bias. As a way of countering that, CivicScape has put its source code on GitHub and is looking for transparency as an ally in improving what it already does well. With Brett Goldstein and Anne Milgram on board, I know they are working very hard to get this right.", "title": "Predictive policing has enormous risks of introducing algorithmic bias. As a way of countering that,..."}, {"content": "This 1993 essay by Robert Putnam (who later wrote the classic book Bowling Alone) on social capital, civic engagement, and prosperity is completely relevant to today's politics. ", "title": "This 1993 essay by Robert Putnam (who later wrote the classic book Bowling Alone) on social capital,..."}, {"content": "As I discover old articles from +Hal Varian and interviews with him like this one, I'm always delighted (but not surprised) by how forward-thinking they have always been. Consider this gem from 2008: \"Back in the early days of the Web, every document had at the bottom, “Copyright 1997. Do not redistribute.” Now every document has at the bottom, “Copyright 2008. Click here to send to your friends.”  That was not as obvious in 2008 as it sounds today!", "title": "As I discover old articles from +Hal Varian and interviews with him like this one, I'm always delighted..."}, {"content": "This is an excellent speech by the former US ambassador to Australia about the world today, ending with insights on how education needs to change. \"If the students we are training today are going to live to be 120 years old, and their careers are likely to span 90 years, but their training will only make them competitive for 10 years, then we have a problem.\" ", "title": "This is an excellent speech by the former US ambassador to Australia about the world today, ending with..."}, {"content": "This is so true. A TRILLION dollar problem, but more than that, a tragedy of wasted - no destroyed - lives.", "title": "This is so true. A TRILLION dollar problem, but more than that, a tragedy of wasted - no destroyed -..."}, {"content": "A populism based on love rather than fear? I’m all in! \"Throughout his papacy, Francis has criticized the lack of that higher purpose in the technocratic liberal administrations of Europe and the Americas that have dominated since the 1980s. He deplores the way political principles have been replaced by market logic and how governments have failed to defend the interests and values of ordinary people. Speaking to Jesuits in Rome last October, he lamented the loss of “big politics,” the craft of making unity out of diversity and creating what he calls a “culture of encounter,” a society that integrates everyone — rather than a “throwaway culture” in which the poor and the unwanted are cast off.\" I spend a lot of time on related topics in my forthcoming book. My framing: The \"master algorithm\" of profit before purpose is destroying our economy and our society. ", "title": "A populism based on love rather than fear? I’m all in! \"Throughout his papacy, Francis has criticized..."}, {"content": "Wow! I thought I was strong on the topic in my forthcoming book, but David Hennemeier Hansen goes biblical on VC fueled startup culture and the cult of exponential growth. \"The goal of the virus is to spread as fast as it can and corrupt as many other cells as possible. How on earth did such a debauched zest become the highest calling for a whole generation of entrepreneurs?\" ", "title": "Wow! I thought I was strong on the topic in my forthcoming book, but David Hennemeier Hansen goes biblical..."}, {"content": "ARPA-E is the Advanced Research Projects Agency for energy innovation. As you might expect, its funding is under attack by the Trump administration. This is the infrastructure investment we need for a better future. My son-in-law Saul Griffith gave a talk on the subject at the recent ARPA-E conference, with an account of the innovative research he has done with the support of ARPA-E; it is summarized here. ", "title": "ARPA-E is the Advanced Research Projects Agency for energy innovation. As you might expect, its funding..."}, {"content": "So glad to see this conservative support for a carbon tax with the proceeds rebated to the public in the form of a Universal Basic Income. It would be great to take advantage of this political moment to rewrite the rules in a positive way.", "title": "So glad to see this conservative support for a carbon tax with the proceeds rebated to the public in..."}, {"content": "This account of a 1964 lecture by a neo-Nazi at UC Berkeley is an excellent explanation of free speech in action, and why “attend-listen-embarrass” is better strategy than violent protest for responding to extremist speech.", "title": "This account of a 1964 lecture by a neo-Nazi at UC Berkeley is an excellent explanation of free speech..."}, {"content": "Wow. Steve Bannon is reading Halberstam's The Best and The Brightest, the book about the impetuous policies that got us deeper into the Vietnam War, but has he learned its lessons? Secretary of Defense Robert McNamara ignored all the people who actually knew anything about the situation in favor of high level ideas about what ought to work. Come to think of it, that's what happened with the Neocons in Iraq. And now with Trump's foreign policy... ", "title": "Wow. Steve Bannon is reading Halberstam's The Best and The Brightest, the book about the impetuous policies..."}, {"content": "This is a profoundly moving editorial from the Jordan Times about the parallels - and the differences - between the Arab Spring and what is happening in the US. \"American citizens experienced in one week what several hundred million Arab men and women have been experiencing for the past half a century or so: power structures that are controlled by a small number of men, revolving around a single family, closely tied to corporate business interests, and taking decisions unilaterally with little interaction with or respect for the elected legislative branch of government, expertise in the scholarly and civil society worlds or the domestic and international rule of law.\"", "title": "This is a profoundly moving editorial from the Jordan Times about the parallels - and the differences..."}, {"content": "I understand Google's goal of dealing with problems algorithmically, but this is shameful. Danny Sullivan explains the reason behind the failure: \"Google has changed its algorithm to reward popular results over authoritative ones. For the reason that it makes Google more money.\"  ", "title": "I understand Google's goal of dealing with problems algorithmically, but this is shameful. Danny Sullivan..."}, {"content": "Design is a key strategic advantage in times of technological change. Connected devices and conversational UI are only two of many dramatic changes designers are coming to grips with. That’s why we introduced a new Design conference at O'Reilly Media. Best price ends today.", "title": "Design is a key strategic advantage in times of technological change. Connected devices and conversational..."}, {"content": "I am in awe both of the depth of Ta-nehisi Coates' insight and the beauty of his writing. This is a must-read. Moving and important. ", "title": "I am in awe both of the depth of Ta-nehisi Coates' insight and the beauty of his writing. This is a ..."}, {"content": "How cool is it that the Dept of Commerce (Census Bureau and more) has Alexa skills! Congrats to Justin Antonipillai for pulling this off. I love it when I can make a suggestion like this and someone just runs with it. ", "title": "How cool is it that the Dept of Commerce (Census Bureau and more) has Alexa skills! Congrats to Justin..."}, {"content": "The tragic Oakland fire is a strong argument for the importance of Carl Malamud's work to make building codes freely available online. An informed citizenry is the best enforcement, yet states keep their building codes behind a paywall, and have sued Carl to keep them that way. Carl believes, rightly, that we should be able to freely read the laws that govern us - and are designed to help us. I'd also love to see more media coverage of \"how to make your loft space safer\" rather than just discussions of whether or not lofts should be shut down. This is a wakeup call to residents, not just building code enforcers! Help them do the right thing, don't just tell them it's someone else's job.", "title": "The tragic Oakland fire is a strong argument for the importance of Carl Malamud's work to make building..."}, {"content": "\"We need to show every American competent government services they can actually use, services that treat them with dignity, and actual economic opportunity.\" Jennifer Pahlka explains how that is just what we are doing in partnership with local and state government at Code for America (and at the federal level via services like USDS and 18F). ", "title": "\"We need to show every American competent government services they can actually use, services that treat..."}, {"content": "Bill Janeway provides powerful historical and economic context for the current state of world politics and what I've been calling the #WTFeconomy. The political trilemma: \"you can have (1) deep economic and financial integration, (2) an autonomous nation-state and (3) responsive, representative government — two out of three. The wave of populism, simultaneously anti-elitist and nativist, that is surging across the US and Europe is evidence that the trilemma cannot be evaded.\"", "title": "Bill Janeway provides powerful historical and economic context for the current state of world politics..."}, {"content": "Before you try to fix a problem, understand it. Saul Griffith and his team at Otherlab have done an astonishingly detailed analysis of how energy gets used in the U.S. If you're an entrepreneur looking at the energy space, this is a map of opportunity. As Saul said to me while looking at a wall sized version of this chart, any line thicker than your little finger is worth billions of dollars. ", "title": "Before you try to fix a problem, understand it. Saul Griffith and his team at Otherlab have done an ..."}, {"content": "I love Andy Revkin’s idea for the “backtrack journal” - tracing the sources of things you see online. Not just for #fakenews but for any unsourced internet meme. Or for that matter, for sourced material. So often, I find myself asking \"Now where did I read that?\" Keeping a journal makes a lot more sense than trying to search for it again! The image below is from an amazing visualization of the passenger density of cars vs buses. But where did it come from? Andy traced it to its source. h", "title": "I love Andy Revkin’s idea for the “backtrack journal” - tracing the sources of things you see online..."}, {"content": "I like to think that O'Reilly books are always a great value, but when they go on special sale, like they are now through Monday, they are a no-brainer. ", "title": "I like to think that O'Reilly books are always a great value, but when they go on special sale, like..."}, {"content": "What coverage of the Hamilton videos teaches us about the right way to protest, and the fake news problem. By following a story all the way to its sources, I see a way to work towards a media \"truthrank.\" ", "title": "What coverage of the Hamilton videos teaches us about the right way to protest, and the fake news problem..."}, {"content": "This is a very good explainer piece about filter bubbles on Facebook and Twitter and how they happen. Read this, and be sure to follow the link it contains to the Wall Street Journal's Blue Feed/Red Feed site. I experienced this first hand in my conversations with some of my own family members. It was clear that we live in completely different media universes, full of different \"facts.\" ", "title": "This is a very good explainer piece about filter bubbles on Facebook and Twitter and how they happen..."}, {"content": "This story is personal and powerful: An incarcerated vet’s TEDx talk about how to end veteran suicide. As another vet once said to me, \"We spend millions of dollars training soldiers to become killing machines, and then when we're done with them, we bring them home and give them nothing.\" Ron Self calls for \"Boot Camp out\" not just Boot Camp on the way in.", "title": "This story is personal and powerful: An incarcerated vet’s TEDx talk about how to end veteran suicide..."}, {"content": "My Ride To Vote has created a crowdfunding campaign to fund a Get Out The Vote effort for Hillary in Pennsylvania. There's a transit strike going on there so this is incredibly important and urgent, according to campaigners on the ground. Every dollar raised will pay for rides to the polls for Hillary voters via Uber and Lyft. I just supported it, and so should you!https://www.crowdpac.com/campaigns/100604", "title": "My Ride To Vote has created a crowdfunding campaign to fund a Get Out The Vote effort for Hillary in..."}, {"content": "Wow. \" Using publicly available voter record data, VoteWithMe predicts the likelihood that contacts in your phone support progressive candidates and which contacts might not vote on election day. Next, we provide you your top 10 contacts that are most likely to be able to tip the scales for Democrats up and down the ballot on election day… if they vote.\" ", "title": "Wow. \" Using publicly available voter record data, VoteWithMe predicts the likelihood that contacts ..."}, {"content": "This is a wonderful analysis of a set of anti-patterns in enterprise software development. While it is pitched as about government, and is based on lessons from the UK Government Digital Service, it is applicable to any large company trying to modernize its technology and practices. ", "title": "This is a wonderful analysis of a set of anti-patterns in enterprise software development. While it ..."}, {"content": "\"It’s billions with a B,” said a cable executive, adding “there’s no business incentive to do so.” What's wrong with this picture? Huge botnet takes down the internet, and ISPs have \"no business incentive\" to deal with the problem? Really? Really? Short term thinking at its worst. ", "title": "\"It’s billions with a B,” said a cable executive, adding “there’s no business incentive to do so.” What's..."}, {"content": "Join Dan Dan Kaminsky for the #OReillySecurity hackathon happening now through the end of the week at the Code for America office in San Francisco. Make TLS/HTTPS easy to deploy. #makesecurityeasy http://oreil.ly/2f54ypw", "title": "Join Dan Dan Kaminsky for the #OReillySecurity hackathon happening now through the end of the week at..."}, {"content": "Start-Up & Vote is a movement to encourage tech communities to vote early and vote together. Get a group together for your city! http://www.startupandvote.com", "title": "Start-Up & Vote is a movement to encourage tech communities to vote early and vote together. Get a group..."}, {"content": "I was one of the warmup acts for President Obama at his Frontiers Conference on Science and Technology last Thursday. I spoke about why we should stop being afraid of AI and put it to work on the world's great problems.I've tried something new here - I put the text and images from my talk into a Medium post so you can read it, but I've also embedded the video and a link to the slides themselves, so you can choose how you want to consume this presentation. Let me know if you like it.It was pretty cool to speak on the same stage as the President. Also kind of cool that I got the White House to approve my opening slide, below. Read the text to see how I used it.", "title": "I was one of the warmup acts for President Obama at his Frontiers Conference on Science and Technology..."}, {"content": "The Bob Dylan selection that Alexa gives me on my Echo in response to \"Play Bob Dylan\" is first rate. It's as good as the four hour mix tape I made my kids back when I wanted to introduce them to \"the best of Dylan.\"  Every song is great, and there are various live renditions that you won't have heard unless you're a die hard Dylan fan. Ditto for David Bowie, who was last night's cooking companion.", "title": "The Bob Dylan selection that Alexa gives me on my Echo in response to \"Play Bob Dylan\" is first rate..."}, {"content": "Chris O'Brien of Venturebeat did a great job of summarizing my exploration of technology and the future of work, which I've called #WTF? and the #NextEconomy. There's lots more to say on this, which is why I'm writing a book on the topic!", "title": "Chris O'Brien of Venturebeat did a great job of summarizing my exploration of technology and the future..."}, {"content": "Honored to be in this month's Wired, one of six people offering \"advice to Silicon Valley\" as part of President Obama's special issue. If you've been following my thoughts on the #NextEconomy, you can guess what I had to say:  focus on using technology to empower people, not to get rid of them, and make sure that your companies create more value than they capture. https://www.wired.com/2016/10/obama-six-tech-challenges/", "title": "Honored to be in this month's Wired, one of six people offering \"advice to Silicon Valley\" as part of..."}, {"content": "From an article about Walmart, their move to pay more, and the lessons for the broader economy: http://www.nytimes.com/2016/10/16/upshot/how-did-walmart-get-cleaner-stores-and-higher-sales-it-paid-its-people-more.html?smprod=nytcore-ipad&smid=nytcore-ipad-share\"What is interesting about this is that, if you look at what’s ailing the broader United States economy, it looks a lot like what you would expect if employers were, en masse, failing to understand the possibility of efficiency wages.Employers have succeeded at holding down labor costs. The “labor share” of national income — the portion of the national economic pie that goes to workers’ pay, as opposed to corporate profits and elsewhere — has fallen. And average pay for nonmanagerial workers has grown more slowly than the overall economy.This has coincided with disappointing results for the economy. Worker productivity has been rising slowly for the last decade, and prime working-age Americans are staying out of the work force in droves. This implies that plenty of people don’t see jobs out there that offer sufficient pay or opportunity to make the jobs worth doing.Individually, employers may think they are making rational decisions to pay people as little as possible. But that may be collectively shortsighted, if the unintended result is less demand for the goods and services they are all trying to sell to these same people.Just maybe, in other words, employers across the country are pushing down labor costs like Walmart, circa 2014 — and this is one of the major culprits behind disappointing economic results since the start of the 21st century.\"“The management philosophy that became popular in the 1980s that led companies to cut pay for low-wage workers, fight unions and contract out work may have been profitable for the companies that practiced it in the short run,” said Alan Krueger, a Princeton economist and leading scholar of labor markets. “But in the long run it has raised inequality, reduced aggregate consumption and hurt overall business profitability.”", "title": "From an article about Walmart, their move to pay more, and the lessons for the broader economy: http..."}, {"content": "“I’m a science geek. I’m a nerd. And I don’t make any apologies for it.” That’s our @POTUS! (I'm so proud to have spoken on the same stage with him at this amazing event.) So many great lines in this talk. It starts a bit slowly, but grows in power as it goes along.  https://www.youtube.com/watch?v=BikQFWNYct4", "title": "“I’m a science geek. I’m a nerd. And I don’t make any apologies for it.” That’s our @POTUS! (I'm so ..."}, {"content": "Here's a video excerpt from my keynote at the O'Reilly AI conference  explaining one of the three reasons I believe we'll never run out of jobs. We'll be talking more about these same topics at the Next:Economy Summit October 10-11 in San Francisco. Join us there! https://www.oreilly.com/ideas/why-well-never-run-out-of-jobs-ai-2016", "title": "Here's a video excerpt from my keynote at the O'Reilly AI conference explaining one of the three reasons..."}, {"content": "I reflect on how algorithms affect not just what news we consume, but what news is produced, and how the consumers, creators, and regulators of algorithms can get better at understanding whether they are trustworthy. In today's overheated political environment, ask what algorithms drive our news leads us in an unexpected direction. ", "title": "I reflect on how algorithms affect not just what news we consume, but what news is produced, and how..."}, {"content": "Not registered to vote? Not sure what you need to do? VotePlz makes it easy to do the right thing. If you care about the direction our country takes, voting is the single most important thing you can do. Low voter participation rates send a strong signal to politicians than no one cares what they do. You don't want that, do you? https://www.voteplz.org/", "title": "Not registered to vote? Not sure what you need to do? VotePlz makes it easy to do the right thing. If..."}, {"content": "This piece about how the pre-civil war south changed its justification for slavery over time is truly eye-opening, and will change the way you think about today's politics as well. I am so glad that Russ Roberts has now put transcripts of his EconTalk podcast on Medium! It makes it much easier to catch them all, and to reference them! ", "title": "This piece about how the pre-civil war south changed its justification for slavery over time is truly..."}, {"content": "My thoughts on conversational interfaces, and why Alexa is now the market leader. If Siri, Google Now, and Cortana aren't studying Alexa very closely, they should be!", "title": "My thoughts on conversational interfaces, and why Alexa is now the market leader. If Siri, Google Now..."}, {"content": "I'm not usually a fan of formulas, but this is intriguing: 15 HigherEd Student Personas That Will Help You Redesign Learner Experience. #LearningDesign #Motivation", "title": "I'm not usually a fan of formulas, but this is intriguing: 15 HigherEd Student Personas That Will Help..."}, {"content": "I never know what I'm going to say when I start an interview. Here are two things I said recently to John Battelle: \"We're suffering from a deficit of idealism,\" and “The obligation and the self‑interest of every company is to build a robust society.” #NextEconomy", "title": "I never know what I'm going to say when I start an interview. Here are two things I said recently to..."}, {"content": "Brilliant: \"People turn to terrorism because they know they cannot wage war, so they opt instead to produce a theatrical spectacle. Terrorists don’t think like army generals; they think like theatre producers....Like terrorists, those combating terrorism should also think more like theatre producers and less like army generals.\" ", "title": "Brilliant: \"People turn to terrorism because they know they cannot wage war, so they opt instead to ..."}, {"content": "So what if the machines are so productive that they take away many of the jobs humans do today? There's so much new work to be done! Let's get the machines to help us do things that are now hard, and free us to do things that are purely human. My latest reflections on Universal Basic Income and the future of work, framed as a series of comments on Keynes' prescient 1930 essay, \"Economic Possibilities for Our Grandchildren,\" and a recent conversation with Y Combinator partner +Paul Buchheit.", "title": "So what if the machines are so productive that they take away many of the jobs humans do today? There's..."}, {"content": "We've now opened registration for the second annual Next:Economy summit. Here is my post announcing what we'll be covering at the event: \"Technology and business as if people matter.\"", "title": "We've now opened registration for the second annual Next:Economy summit. Here is my post announcing ..."}, {"content": "You've got to love this guy! So glad that he'll be a speaker at my Next:Economy Summit in October.http://www.inc.com/magazine/201606/sheila-marikar/lola-paul-english-uber.html", "title": "You've got to love this guy! So glad that he'll be a speaker at my Next:Economy Summit in October.\n\n..."}, {"content": "Good piece about self driving cars and the disruption that Detroit is trying to embrace before it runs over them.", "title": "Good piece about self driving cars and the disruption that Detroit is trying to embrace before it runs..."}, {"content": "If you love Hamilton, as I do, and you're interested in data visualization, you'll find this fascinating!", "title": "If you love Hamilton, as I do, and you're interested in data visualization, you'll find this fascinating..."}, {"content": "Struck by how similar the investment model for Hamilton is to +Bryce Roberts Indie.vc model nyti.ms/1UbkG1J", "title": "Struck by how similar the investment model for Hamilton is to +Bryce Roberts Indie.vc model nyti.ms/..."}, {"content": "The deep learning video collection from O'Reilly Media makes me wish I had more hours in the day. It's for sale at oreilly.com or included in your Safari subscription. ", "title": "The deep learning video collection from O'Reilly Media makes me wish I had more hours in the day. It's..."}, {"content": "Smart piece by David Brin about the abuse of Adam Smith and Friedrich Hayek by their supposed followers. Worth reading to arm yourself when the kneejerk libertarians start mouthing off about Hayek.  If you believe in free markets, you should be extremely concerned about the world's trend towards economic oligarchy.", "title": "Smart piece by David Brin about the abuse of Adam Smith and Friedrich Hayek by their supposed followers..."}, {"content": "Nick Hanauer is so quotable. He talks “Trickle down clowns,” wage suppression, and corporate welfare in this Bill Maher segment about the $15 minimum wage. https://www.youtube.com/watch?v=QyXG8pYZ054 For the intellectual underpinnings of Nick's comments on Bill Maher, see http://democracyjournal.org/magazine/41/a-threat-not-a-theory/ I love Nick's point (which I first heard him make last year at my Next:Economy Summit) that the threat of downsizing workers in response to a higher minimum wage is \"an intimidation tactic masquerading as an economic theory.", "title": "Nick Hanauer is so quotable. He talks “Trickle down clowns,” wage suppression, and corporate welfare..."}, {"content": "I wrote a short piece for Sloan Management Review about 21st century management. My thoughts strayed to the role of programmers in managing bots, and of bots in managing humans. Sometimes you have to look sideways at the present to see the future.", "title": "I wrote a short piece for Sloan Management Review about 21st century management. My thoughts strayed..."}, {"content": "“Before Indie.vc, I was focused on raising a million dollars. Now I’m focused on generating a million dollars in revenue”  Candace Mitchell, Founder of Myavana, quoted by my partner Bryce Roberts of indie.vc and OATV ", "title": "“Before Indie.vc, I was focused on raising a million dollars. Now I’m focused on generating a million..."}, {"content": "Beautiful exposition by Michael Nielsen on how “cognitive media” helps us think and advance our work. Starts with music, aims at math. ", "title": "Beautiful exposition by Michael Nielsen on how “cognitive media” helps us think and advance our work..."}, {"content": "A lot of people have asked me to respond to +Paul Graham’s piece about income inequality. Here it is. I suspect that this is just one more step in a long discussion that we will be having.", "title": "A lot of people have asked me to respond to +Paul Graham’s piece about income inequality. Here it is..."}, {"content": "So nice to see @pahlkadot and @codeforamerica recognized by the 2016 David Packard Award for civic entrepreneurship http://www.jointventure.org/news-and-media/news-releases/1354-code-for-america-founder-jennifer-pahlka-named-recipient-of-joint-venture-s-2016-packard-award", "title": "So nice to see @pahlkadot and @codeforamerica recognized by the 2016 David Packard Award for civic e..."}, {"content": "I've been deeply touched by the stories of Syrian refugees in Brandon Stanton's Humans of New York feed, and a great way to help is through direct donations to the families involved, through HONY's Generosity Fundraiser: ", "title": "I've been deeply touched by the stories of Syrian refugees in Brandon Stanton's Humans of New York feed..."}, {"content": "Excellent MIT Tech Review  profile of my friend Gary Marcus and his #AI company Geometric Intelligence http://www.technologyreview.com/featuredstory/544606/can-this-man-make-ai-more-human/ ", "title": "Excellent MIT Tech Review  profile of my friend Gary Marcus and his #AI company Geometric Intelligence..."}, {"content": "I'll be on the Breaking Banks podcast at noon pacific time today, talking about technology and the coming disruption of financial markets. This is also the subject of our upcoming Next:Money conference. (http://conferences.oreilly.com/nextcon/money-fintech-us)", "title": "I'll be on the Breaking Banks podcast at noon pacific time today, talking about technology and the coming..."}, {"content": "This is the fascinating bit: \"the rise of sharing economy companies follows rather than causes the bulk of the increase in independent contracting.\"", "title": "This is the fascinating bit: \"the rise of sharing economy companies follows rather than causes the bulk..."}, {"content": "I dreamed last night that Donald Trump was taking people on a tour through a haunted house, and leaving them to pay a big bill afterward. Pretty apt symbolism.", "title": "I dreamed last night that Donald Trump was taking people on a tour through a haunted house, and leaving..."}, {"content": "Nassau, The Bahamas Airport Travel AdviceIf anyone happens to travel to Nassau, the Bahamas, I thought I'd pass on a travel tip.  They insist that you get to the airport 3 hours before your flight, and that turns out to be completely unnecessary.  I tried to target 90 minutes, just to be safe, but the event organizers for the event I was at hustled me out to get there about two hours before the flight. It took me no more than ten minutes to get through the entire process - security AND US Customs, so I ended up at the gate for the better part of two hours.  Your mileage may vary - I have global entry, but even without that, there was no line.  However, I was told at the airport that it was particularly light, and that if you have to check baggage or check in at the airport, the check in desks close an hour before the flight.  But if you have a boarding pass, and aren't checking luggage, I'd bet an hour before the flight is easily sufficient.I suppose that it is worth checking how many other flights are going out about the same time as yours. At my hotel, they listed all the flights, so it would be easy to see. I was traveling on the first flight out on a Saturday morning, and there may be other times that are much more crowded.  ", "title": "Nassau, The Bahamas Airport Travel Advice\n\nIf anyone happens to travel to Nassau, the Bahamas, I thought..."}, {"content": "Amazing story about digital transformation http://www.codeforamerica.org/blog/2015/11/30/a-new-approach-to-procuring-government-technology-in-california/ \"Government Procurement: A New Hope” :-)\"This fall, I started working with a small, cross-agency team at the California state capital in Sacramento to see how practical and realistic it would be to move from a traditional, large, and typically risky RFP for an entire system to a set of smaller RFPs, explicitly requiring user-centered, agile, iterative development. With this would come a fundamental change: from procuring or buying a set solution to building California’s ability to understand, direct, and control the critical technology needed for government to do its job well....\"But why would a Child Welfare System in particular be a good choice for this new approach? Child welfare services personnel in California investigate nearly half a million reports of severe maltreatment and life-threatening neglect to children a year. Of those half a million, around 80,000 reports are confirmed annually, 30,000 children must be removed from their homes, and at any time almost 100,000 children are living in foster care for their protection or live with their parents under close county protective supervision. The Child Welfare System was the perfect choice for a new approach because it’s too important to fail.\"", "title": "Amazing story about digital transformation http://www.codeforamerica.org/blog/2015/11/30/a-new-approach..."}, {"content": "Cool use of Minecraft for conservation!", "title": "Cool use of Minecraft for conservation!"}, {"content": "Safari is O'Reilly's subscription access program - thousands of hours of video (including full video from many O'Reilly conferences) and tens of thousands of books from O'Reilly and many other publishers.  Check out our cyber-Monday offer: $199/year for complete access.", "title": "Safari is O'Reilly's subscription access program - thousands of hours of video (including full video..."}, {"content": "John Oliver: \"There was only one time in American history when the fear of refugees wiping everyone out did actually come true...\"“...and we’ll be celebrating it on Thursday.”That's maybe the best line, but there's lots of substance here too. Well worth watching.", "title": "John Oliver: \"There was only one time in American history when the fear of refugees wiping everyone ..."}, {"content": "Video learning paths have been a huge hit on oreilly.com. They are available on @safari too.", "title": "Video learning paths have been a huge hit on oreilly.com. They are available on @safari too."}, {"content": "Here are the 2016 @codeforamerica Fellowship partner cities. Can’t wait to see the impact of these projects!", "title": "Here are the 2016 @codeforamerica Fellowship partner cities. Can’t wait to see the impact of these projects..."}, {"content": "Absolutely brilliant piece about complexity, public policy, and business From #NextEconomy speaker Esko Kilpi. He is such a fresh business thinker. Every time I read his stuff, I come away looking at the world differently.", "title": "Absolutely brilliant piece about complexity, public policy, and business From #NextEconomy speaker Esko..."}, {"content": "Portable benefits tied to the worker, not the company, are key to rethinking the social safety net for the #NextEconomy I'm proud to be a signatory to this open letter calling for this key policy innovation. One thing I'd add is that this could have an impact on traditional W2 workers as well, making it easier for them to work for multiple employers. https://medium.com/@principles/common-ground-for-independent-workers-83f3fbcf548f", "title": "Portable benefits tied to the worker, not the company, are key to rethinking the social safety net for..."}, {"content": "I was on KQED Forum this morning, talking with Michael Krasny about technology and the future of work - and how companies need to change as a result of some current trends.", "title": "I was on KQED Forum this morning, talking with Michael Krasny about technology and the future of work..."}, {"content": "I just finished my product hunt AMA. I wrote quite a bit, on a lot of topics! https://www.producthunt.com/live/tim-o-reilly", "title": "I just finished my product hunt AMA. I wrote quite a bit, on a lot of topics! https://www.producthunt.com..."}, {"content": "I loved this piece! Why companies invest in the future, and why nations should do so too.  ", "title": "I loved this piece! Why companies invest in the future, and why nations should do so too.  "}, {"content": "I'm doing a ProductHunt AMA at 9 am PT this morning.  I love getting people thinking harder about how technology can make the world a better place. In the past, I've focused a lot on areas like open source software and the implications of big data and collective intelligence. Right now, I'm exploring how AI, robotics, the on-demand economy, and augmented reality are changing the future of work. I'm running the Next:Economy Summit to explore the implications for business, for workers, and for the economy as a whole. Ask me anything, but I'd particularly like to talk about the future of work.", "title": "I'm doing a ProductHunt AMA at 9 am PT this morning.  I love getting people thinking harder about how..."}, {"content": "Just published a narrative describing the nearly final schedule for the Next:Economy Summit. Hope to see many of you there!", "title": "Just published a narrative describing the nearly final schedule for the Next:Economy Summit. Hope to..."}, {"content": "This is a wonderful meditation by Walter Isaacson on the role of imagination in science, on the 100th anniversary of Einstein’s General Theory of Relativity http://nyti.ms/1NKuKgB ", "title": "This is a wonderful meditation by Walter Isaacson on the role of imagination in science, on the 100th..."}, {"content": "I wasn’t entirely happy with my new #NextEconomy piece, Escaping the Superstar Syndrome, so I updated it this morning. BTW, despite the cover picture, it's not about basketball, but about what the new economy teaches us about valuing every worker, giving them the freedom to do their best, and building better teams.", "title": "I wasn’t entirely happy with my new #NextEconomy piece, Escaping the Superstar Syndrome, so I updated..."}, {"content": "Totally hilarious and spot-on. Has to be the best public service video ever done by a government office.  A small police department in the UK.", "title": "Totally hilarious and spot-on. Has to be the best public service video ever done by a government office..."}, {"content": "It's easy to think that the technology revolution that started in Silicon Valley doesn't apply to your company - until it does. (Just ask taxi companies and hotels, who have now joined media companies in the crosshairs of disruption.) But you don't have to wait to be run over. Watch this keynote by Jeff Immelt, Chairman and CEO at GE, to see how understanding where technology is going can help any business to transform itself. That's why I've got Jeff on stage with me at my Next:Economy Summit, Nov 12-13 in San Francisco https://conferences.oreilly.com/next-economy", "title": "It's easy to think that the technology revolution that started in Silicon Valley doesn't apply to your..."}, {"content": "So Bill Gates thinks we need to 'science the shit' out of energy (and have a carbon tax.) So do I.", "title": "So Bill Gates thinks we need to 'science the shit' out of energy (and have a carbon tax.) So do I."}, {"content": "One reason I use f.lux on my mac, and wish it were available for all my devices...", "title": "One reason I use f.lux on my mac, and wish it were available for all my devices..."}, {"content": "I explain to Emily Chang at Bloomberg the urgency of the issues that I'm wrestling with in my Next:Economy Summit (Nov 12-13 in San Francisco, https://conferences.oreilly.com/next-economy), and why so many senior tech leaders are going to be there. ", "title": "I explain to Emily Chang at Bloomberg the urgency of the issues that I'm wrestling with in my Next:Economy..."}, {"content": "Crate stacking is hard! (At least for me.) But there's so much other great stuff at East Bay Mini Maker Faire​ in Oakland tomorrow. I'll be there. If you live in the Bay Area, come on over!", "title": "Crate stacking is hard! (At least for me.) But there's so much other great stuff at East Bay Mini Maker..."}, {"content": "Part One of my NBC Press:Here TV interview from Friday. I talk about the history and mission of O'Reilly Media, the on-demand economy, unicorns and bubbles, and my upcoming Next:Economy Summit. (Part Two is in a separate post.)http://www.pressheretv.com/tim-oreilly/", "title": "Part One of my NBC Press:Here TV interview from Friday. I talk about the history and mission of O'Reilly..."}, {"content": "Part Two of my NBC Press:Here TV interview from ", "title": "Part Two of my NBC Press:Here TV interview from "}, {"content": "\"Surely Democrats and Republicans could agree to cut billions from a failed program like this!\" you think. What their failure to do so says something about politics, but I think it also speaks to the failed regulatory model that we use to manage programs like this.  From the article:  \"Consider the Education Management Corporation, which runs 110 schools in the United States for chefs, artists and other trades. It has been investigated or sued in recent years by prosecutors in at least 12 states. The Justice Department has accused the company of illegally using incentives to pay its recruiters. And last year, investors filed a class-action lawsuit, contending that the company engaged in deceptive enrollment practices and manipulated federal student loan and grant programs. Education Management nonetheless received more than $1.25 billion in federal money over the last school year....\"The continuing flow of money illustrates the quandary facing federal education officials. On one hand, they have moved forcefully to try to protect taxpayer funds and prevent students from falling deeply into debt without anything to show for it. On the other, they must avoid running roughshod over private for-profit schools that have not been found guilty of wrongdoing. Agency officials point out that they cannot withhold money based on accusations, but must have proof of misconduct.\"The fundamental notion that you can only regulate by punishing wrongdoing is at the heart of the failure. Good regulatory systems are management systems, that keep a system operating smoothly.A plane's autopilot does not kick in after the plane has crashed. It is designed to keep it from crashing. Credit card fraud detection software doesn't wait till you've gone bankrupt from fraudulent charges to intervene and stop further transactions. Google search quality doesn't reserve space in the top spots for spammers lest it hurt their business!These practical and commercial regulatory regimes should be a model for how we think about government regulation as well.I've written about this topic at greater length in my article Open Data and Algorithmic Regulation:  http://beyondtransparency.org/chapters/part-5/open-data-and-algorithmic-regulation/", "title": "\"Surely Democrats and Republicans could agree to cut billions from a failed program like this!\" you ..."}, {"content": "I love that +Kickstarter  and the UN Refugee Agency are partnering to raise money for Syrian refugees. This is a real opportunity to step up folks. It's easy to do \"clicktivism.\" Let's raise some serious money for people who are in real need.If you want some human stories about the refugee crisis, go to humansofnewyork.com (or follow here, or  on Instagram or Facebook.) Brandon Stanton has been doing an amazing job of humanizing the crisis. +Humans of New York ", "title": "I love that +Kickstarter  and the UN Refugee Agency are partnering to raise money for Syrian refugees..."}, {"content": "Data can play a great role in advancing sustainability. I'm quoted in this short video from Planet Labs, in conjunction with their speech at the UN, about the need for a common data infrastructure for sustainability.", "title": "Data can play a great role in advancing sustainability. I'm quoted in this short video from Planet Labs..."}, {"content": "This story of Afghan “aid” highlights how often cupidity and political theater overrule strategic goals. So often in Washington, the press conference and the resulting coverage is the main objective. And foreign aid is so often seen as a way to boost American businesses rather than a clear-eyed and sincere attempt to solve a problem. ", "title": "This story of Afghan “aid” highlights how often cupidity and political theater overrule strategic goals..."}, {"content": "My latest post on Medium. I describe what makes a real unicorn. Hint: It's not the valuation.", "title": "My latest post on Medium. I describe what makes a real unicorn. Hint: It's not the valuation."}, {"content": "How fragile life is, even for the best of us. We heard this morning that our friend Jake Brewer was killed yesterday in a bike accident. I try to take comfort in poetry. I have always loved Wallace Stevens' thoughts in Esthetique du Mal in moments like this:\"He breathes a summer sleep,In which his wound is good because life was.No part of him was ever part of death.\"And yes, there is somehow a deep continuity, in which we all one way or another come to that moment of our undoing, and our end is just one more part of a good life. None of us know when it will be. So we have to make the most of each moment - and that's what Jake did, throwing himself into life, fully.But it's still a tragedy. Edna St Vincent Millay captured that tragedy perfectly in Dirge without Music:\"I am not resigned to the shutting away of loving hearts in the hard ground.So it is, and so it will be, for so it has been, time out of mind:Into the darkness they go, the wise and the lovely. CrownedWith lilies and with laurel they go; but I am not resigned.Lovers and thinkers, into the earth with you.Be one with the dull, the indiscriminate dust.A fragment of what you felt, of what you knew,A formula, a phrase remains,—but the best is lost.The answers quick and keen, the honest look, the laughter, the love,—They are gone. They are gone to feed the roses. Elegant and curledIs the blossom. Fragrant is the blossom. I know. But I do not approve.More precious was the light in your eyes than all the roses in the world.Down, down, down into the darkness of the graveGently they go, the beautiful, the tender, the kind;Quietly they go, the intelligent, the witty, the brave.I know. But I do not approve. And I am not resigned.\"", "title": "How fragile life is, even for the best of us. We heard this morning that our friend Jake Brewer was ..."}, {"content": "Just published the latest in my #WTFEconomy (What's the Future of Work) series of essays on Medium. I make the case for Uber's surge pricing, and point out that algorithms don’t stand still.", "title": "Just published the latest in my #WTFEconomy (What's the Future of Work) series of essays on Medium. ..."}, {"content": "Neil Gaiman is a magical writer. This is a fabulous opportunity to own DRM-free ebooks by Neil, with the proceeds going to charity.", "title": "Neil Gaiman is a magical writer. This is a fabulous opportunity to own DRM-free ebooks by Neil, with..."}, {"content": "So good: \"Overwork is not defined by the amount of our day work occupies but by the amount of our selves tied up to it. We “over” work not when we work too hard but when working becomes less of a means and more of an end. When meditation, exercise, sleep, holidays, and even parenting, are cast as tools to make us better workers.\"", "title": "So good: \"Overwork is not defined by the amount of our day work occupies but by the amount of our selves..."}, {"content": "Here is the latest in my  #WTFeconomy  series of posts on Medium. (Earlier posts include The WTF Economy (https://medium.com/the-wtf-economy/the-wtf-economy-a3bd5f52ef00) and Networks and the Nature of the Firm (https://medium.com/the-wtf-economy/networks-and-the-nature-of-the-firm-28790b6afdcc). Still to come: These Are The Days of Miracles and Wonders, The Augmented Worker, and more.) These articles are exploring technology and the future of work, and are leading up to an event in November called the Next:Economy Summit (http://conferences.oreilly.com/next-economy)", "title": "Here is the latest in my #WTFeconomy  series of posts on Medium. (Earlier posts include The WTF Economy..."}, {"content": "This just in from my friend +Brian Forde:\"A couple of weeks ago we announced $75,000 in scholarships for 50 young women and underrepresented people of color to attend the CoinDesk Consensus 2015 digital currency conference in NY on September 10th. http://www.coindesk.com/press-releases/consensus-2015-is-joining-with-the-mit-media-labs-digital-currency-initiative-to-offer-50-diversity-and-inclusion-scholarships/The deadline to apply for the scholarship to attend the conference is this Friday.\"", "title": "This just in from my friend +Brian Forde:\n\n\"A couple of weeks ago we announced $75,000 in scholarships..."}, {"content": "Lovely quote from Wallace Stevens: \"“One may find intimations of immortality in an object on the mantelpiece; and these intimations are as real in the mind in which they occur as the mantelpiece itself.\" (The Necessary Angel, Vintage edition page 74). I love how Stevens sees the interplay of reality and the mind. It is a recurring theme through his work, and one that has deeply shaped my own thinking.", "title": "Lovely quote from Wallace Stevens: \"“One may find intimations of immortality in an object on the mantelpiece..."}, {"content": "My new essay on what I've been calling \"The WTF Economy.\" (In case you missed it, the first essay is here: https://medium.com/the-wtf-economy", "title": "My new essay on what I've been calling \"The WTF Economy.\" (In case you missed it, the first essay is..."}, {"content": "Love this from +Liza Daly: \"If you have a responsibility for hiring people, at any level, you have one superpower that can change the future culture and direction of your organization: tell your new hires that the company already is the way you wish it were.\"", "title": "Love this from +Liza Daly: \"If you have a responsibility for hiring people, at any level, you have one..."}, {"content": "Excellent set of principles for digital government. Echoes those put forward by the UK Government and by Code for America, but articulated by former staffers from the White House and a key staffer from the Republican-controlled Congress. Getting digital government right is something both parties ought to be able to get behind!", "title": "Excellent set of principles for digital government. Echoes those put forward by the UK Government and..."}, {"content": "Today is the last day! Submit a proposal for O'Reilly's Design Conference!", "title": "Today is the last day! Submit a proposal for O'Reilly's Design Conference!"}, {"content": "My new post on Medium explains what I've been up to lately. I'm fascinated by how technology is driving fundamental shifts in the economy and the nature of work.", "title": "My new post on Medium explains what I've been up to lately. I'm fascinated by how technology is driving..."}, {"content": "I was inspired to think differently when I read Barbara Ehrenreich's Nickel and Dimed in America. If you don't have time for the book, read this Atlantic article, which brings the story up to date. I love her notion that minimum wage workers are philanthropists, giving their work to the rest of society for less than it costs to provide.", "title": "I was inspired to think differently when I read Barbara Ehrenreich's Nickel and Dimed in America. If..."}, {"content": "I love the quote from Hesiod, Works and Days: “The gods keep livelihood hidden from men. Otherwise a day’s labor could bring man enough to last a whole year with no more work.” Very apt, because I'm working on a new event about the future of work, and I like to mix my reflections on the future with thinking from the past.", "title": "I love the quote from Hesiod, Works and Days: “The gods keep livelihood hidden from men. Otherwise a..."}, {"content": "If you haven't checked out Safari lately (O'Reilly Media's online learning service, whose name predates that of Apple's browser, if you wonder why we named it that!), you should. We have a new version, and to encourage people to try it, we have an amazing sale for people who sign up for an annual subscription. +Liza Daly explains more below about what's on offer in the new service.", "title": "If you haven't checked out Safari lately (O'Reilly Media's online learning service, whose name predates..."}, {"content": "We just unveiled the project I've been working on for the past six months or so (really, the past couple of years, but only explicitly the past six months), a new event called Next:Economy, also known as WTF? What's the Future of Work?  It's a look at robots, AI, and the on-demand economy, and what they tell us about the future of work, the shape of corporations, and the issues we should be grappling with now if we want these profound changes to come out for the best.My co-host for the event is Steven Levy of Medium. While the speaker list is still preliminary, it tells the story of what we're going after. Explore the speaker pages - I've loaded them with quotes from the speakers, which will help you understand in advance where they are coming from. Over the next few weeks and months, we'll be curating an online conversation, with lots of great reading and viewing, to engage with these ideas, whether or not you are coming to the event.", "title": "We just unveiled the project I've been working on for the past six months or so (really, the past couple..."}, {"content": "Fabulous read from Thomas Piketty on Germany's own history of debt relief, vs its current stance towards Greece:\"We need to look ahead. Europe was founded on debt forgiveness and investment in the future. Not on the idea of endless penance.\"", "title": "Fabulous read from Thomas Piketty on Germany's own history of debt relief, vs its current stance towards..."}, {"content": "Wondering who designed, and who tested, the \"improved\" Google contacts interface (as displayed  in Chrome on a Mac). It is a disgrace. I get to see all my recent conversations with someone - cool - but what if I want to do something basic, like look up their address? Oh, wait, it's in a popup that isn't wide enough to show the whole address field if I have a lot of data in the record, and the only way to see it all is with a mouseover, but to copy it, you have to go into edit mode. (Clicking on the field opens a map.  Whoopee! Note to developers: once you have basic features working, don't break them when you add new, \"cool\" features.This interface is a huge step backwards.  Something that used to be accomplished with one click now takes three or four. And exiting from a single card is also incredibly awkward!", "title": "Wondering who designed, and who tested, the \"improved\" Google contacts interface (as displayed  in Chrome..."}, {"content": "Just discovered (via Laszlo Bock's Work Rules) a fabulous essay by Henry Ford explaining why it's important for businesses to pay employees well. He writes:\"Paying good wages is not charity at all it is the best kind of business.\"The man who comes to the day's feeling that no matter how much he give it will not yield him enough of a to keep him beyond the margin of want not in shape to do his day's work. He is anxious and worried and it all reacts to detriment of his work. But if a man feels that his day's work not only supplying his basic .need but also giving him a margin of comfort enabling him to give his boys and girls opportunity and his wife some pleasure life then his job looks good to him and he free to give it his very best.\"This is a good thing for him and a thing for the business The man who not get a certain satisfaction out of his work is losing the best part of his pay.\"", "title": "Just discovered (via Laszlo Bock's Work Rules) a fabulous essay by Henry Ford explaining why it's important..."}, {"content": "A very good piece by +Sean Parker about \"Hacker Philanthropy.\"  How the tech generation can and should approach the challenge of using their wealth to make a better world. Congrats to Sean on the rollout of the Parker Foundation.http://www.wsj.com/articles/sean-parker-philanthropy-for-hackers-1435345787", "title": "A very good piece by +Sean Parker about \"Hacker Philanthropy.\"  How the tech generation can and should..."}, {"content": "Does Pope Francis look gloomy to you?This is a brilliant, funny takedown of the conservative Catholic pundits' and politicians' critique of Pope Francis' climate change encyclical.", "title": "Does Pope Francis look gloomy to you?\n\nThis is a brilliant, funny takedown of the conservative Catholic..."}, {"content": "I'm proud to be a judge for the new +Code for America tech awards. If you are doing something remarkable with government technology, either as a vendor or as a government customer, let us know. We want to celebrate you, and help others to follow in your footsteps.  Applications for the awards are due by July 13, at the URL below.", "title": "I'm proud to be a judge for the new +Code for America tech awards. If you are doing something remarkable..."}, {"content": "Congratulations to @dalepd, @gbrockway and the whole @make Team on the new financing. And welcome aboard, @rafe!", "title": "Congratulations to @dalepd, @gbrockway and the whole @make Team on the new financing. And welcome aboard..."}, {"content": "Brilliant post by @JonBruner on why the new hardware movement is way bigger than the #IoT. A must-read, IMO!", "title": "Brilliant post by @JonBruner on why the new hardware movement is way bigger than the #IoT. A must-read..."}, {"content": "I really like the way +Bryce Roberts explains why he chose the indie.vc companies:\"It’s an experiment. \"And one rooted in finding, organizing and working with founders who want nothing less than to build large, scalable businesses on their own terms. The diversity of this first group represents fertile soil where we can test and measure for whom this approach works best and for whom what we have to offer doesn’t move the needle.\"Very smart.  And having met with the initial group of companies, not just a thoughtful experiment but a really great group of entrepreneurs with interesting businesses!  It is so important to expand the venture ecosystem beyond the usual suspects and the usual business models. Most of the entrepreneurs in the world, even in tech, don't necessarily fit the overheated Silicon Valley mold.", "title": "I really like the way +Bryce Roberts explains why he chose the indie.vc companies:\n\n\"It’s an experiment..."}, {"content": "Matt Cutts, for so long the most human face of Google, and a wonderful human being. In the halls at Google I/O.", "title": "Matt Cutts, for so long the most human face of Google, and a wonderful human being. In the halls at ..."}, {"content": "Good summary of my CxO Talk interview last week, highlighting key points. And of course the entire hour long video is there too, if you have the time.", "title": "Good summary of my CxO Talk interview last week, highlighting key points. And of course the entire hour..."}, {"content": "This piece by Bill Janeway should be required reading for anyone trying to understand the implications (and the future) of the current Silicon Valley financing bubble. Complex and insightful!", "title": "This piece by Bill Janeway should be required reading for anyone trying to understand the implications..."}, {"content": "Brilliant and important! \"What we have, uniquely in America, is a political class, and an entire political party, devoted to the idea that any money spent on public goods is money misplaced, not because the state goods might not be good but because they would distract us from the larger principle that no ultimate good can be found in the state. Ride a fast train to Washington today and you’ll start thinking about national health insurance tomorrow.\"", "title": "Brilliant and important!\n\n\"What we have, uniquely in America, is a political class, and an entire political..."}, {"content": "I like how Evan thinks. Smart, and with good values.", "title": "I like how Evan thinks. Smart, and with good values."}, {"content": "A good example of why you can think of edge.org as TED in text form :-)  It's full of brilliant essays and interviews like this.BTW, if you find this essay interesting, be sure to check out Yuval Noah Hariri's book Sapiens, which is precisely an attempt at this kind of \"big history\" of our species.  It covers familiar ground, but makes it new.  I knew I had to read it when I saw a review by +daniel kahnemann where he said he'd read it three times, and I have to say that it doesn't disappoint. You can find that here: http://www.amazon.com/Sapiens-Humankind-Yuval-Noah-Harari/dp/0062316095/ref=asap_bc?ie=UTF8", "title": "A good example of why you can think of edge.org as TED in text form :-)  It's full of brilliant essays..."}, {"content": "Encourage your local superintendent to get involved!", "title": "Encourage your local superintendent to get involved!"}, {"content": "The Master in the Art of Living\"The master in the art of living makes little distinction between his work and his play, his labor and his leisure, his mind and his body, his education and his recreation, his love and his religion. He hardly knows which is which. He simply pursues his vision of excellence at whatever he does, leaving others to decide whether he is working or playing. To him he is always doing both.\"Lawrence Pearsall Jacks(Often incorrectly attributed to James Michener)quoteinvestigator.com/2010/08/27/master/Thanks so much to Giancarlo Gonzalez, who recited this one to me by heart. I will have to add it to my repertoire!", "title": "The Master in the Art of Living\n\n\"The master in the art of living makes little distinction between his..."}, {"content": "My post explaining the in-progress redesign of oreilly.com.", "title": "My post explaining the in-progress redesign of oreilly.com."}, {"content": "Painting by Jeannette Charoy at Pamil Fine Arts. Love this one. Thanks for showing it to us, Giancarlo Gonzalez!", "title": "Painting by Jeannette Charoy at Pamil Fine Arts. Love this one. Thanks for showing it to us, Giancarlo..."}, {"content": "Lovely paean to the jobs of book collecting!This is what Milton means in his sublime “Areopagitica,” as necessary now as it was in 1644, when he asserted that “books are not absolutely dead things, but do contain a potency of life in them to be as active as that soul was whose progeny they are; nay, they do preserve as in a vial the purest efficacy and extraction of that living intellect that bred them.”", "title": "Lovely paean to the jobs of book collecting!\n\nThis is what Milton means in his sublime “Areopagitica..."}, {"content": "Morning run at Lake MerrittFive more reasons to love living in Oakland.", "title": "Morning run at Lake Merritt\n\nFive more reasons to love living in Oakland."}, {"content": "\"You can add up all the yearly visitors to the city's baseball stadiums, its basketball and hockey arenas, all its performing-arts spaces, city-owned museums, gardens and zoos and you'll never get to 37 million, the number of people who used the city's underfunded, overburdened, utterly essential libraries in the last fiscal year.\"via +lorcan dempsey ", "title": "\"You can add up all the yearly visitors to the city's baseball stadiums, its basketball and hockey arenas..."}, {"content": "+Jennifer Pahlka and I share a moment of joy at the top of Warmiwanuska Pass, the highest point on the Inca Trail (just shy of 14,000 feet.) This was followed by 2500 steps down the other side, then a couple of thousand back up to the top of the next pass. But we had a blast!", "title": "+Jennifer Pahlka and I share a moment of joy at the top of Warmiwanuska Pass, the highest point on the..."}, {"content": "Zach Bogue - here I am wearing my Founder's Den t-shirt while hiking the Inca Trail!", "title": "Zach Bogue - here I am wearing my Founder's Den t-shirt while hiking the Inca Trail!"}, {"content": "+Jennifer Pahlka has some visitors during lunch on our first day hiking the Inca Trail last week.", "title": "+Jennifer Pahlka has some visitors during lunch on our first day hiking the Inca Trail last week."}, {"content": "Utterly magnificent views on the hike up from Urubamba to Maras.", "title": "Utterly magnificent views on the hike up from Urubamba to Maras."}, {"content": "That's a heck of a collection! Clever idea to display their impounded blades!", "title": "That's a heck of a collection! Clever idea to display their impounded blades!"}, {"content": "Texas has nothing on Peru. They like their Coca-Cola big down here!", "title": "Texas has nothing on Peru. They like their Coca-Cola big down here!"}, {"content": "Brilliant remarks by +Mikey D about what he learned from the healthcare.gov rescue and why he left Google for the White House. This is a must-read for anyone who cares about the future of our country.", "title": "Brilliant remarks by +Mikey D about what he learned from the healthcare.gov rescue and why he left Google..."}, {"content": "Fascinating piece by Larry Summers about educational attainment and income inequality.  Not what you'd expect:", "title": "Fascinating piece by Larry Summers about educational attainment and income inequality.  Not what you'd..."}, {"content": "My latest @radar post: #SocialCivics and the architecture of participation. Inspired by @goldman joining @WhiteHouse. He said he was looking for advice, so I gave some. The key message: successful participatory projects, from open source software to wikis to social media, all have small, modular units of participation. Washington generally does not. Change that.", "title": "My latest @radar post: #SocialCivics and the architecture of participation. Inspired by @goldman joining..."}, {"content": "My dear friend Carolyn Shapiro does amazing projects that help communities understand their history, and bring people together by honoring their heritage. Here is her latest, funded by Kickstarter.  I'm a supporter, and I hope you will be too.  She writes:\"The Barre Historical Society in Barre, Vermont is reviving a 1913 bakery built by the Italian granite workers to give the community good wood fired Italian bread.  We have chosen to rename the Union Cooperative Store Bakery, Rise Up Bakery, because the bakery will once again rise up in honor of the Italian granite workers who volunteered to build it and to honor the rising up in their labor history.  The many hands lifting the bread in the logo are appreciation for the cooperative way the granite workers functioned to build the bakery and to help each other in difficult times.  Kickstarter is like that cooperative action!  Rise Up Bakery will be an educational center and not a commercial bakery.  We will learn to bake with a wood fired oven and learn about Barre's rich labor history.  We hope you will “rise up” and help the Barre Historical Society  realize this wonderful  goal.\"", "title": "My dear friend Carolyn Shapiro does amazing projects that help communities understand their history,..."}, {"content": "It is amazing to see trees in full bloom in Vancouver in March. Many of them are in fact past their peak. I was surprised to see spring so far north, apparently the better part of a month early.", "title": "It is amazing to see trees in full bloom in Vancouver in March. Many of them are in fact past their ..."}, {"content": "9 days until SXSW Interactive: White House tech wiz Mikey Dickerson joins @pahlkadot on March 16 to talk about How Government Fails and How You Can Fix It.  It's not just healthcare.gov (which Mikey helped fix). Why do US taxpayers still pay hundreds of millions of dollars for websites that should cost thousands (and often don’t work)? The real reasons may surprise you. For government to work in the 21st century, it must become competent – even great – at digital. The bad news is that no one is going to do that for us. It’s the job of the American people. The good news is that it’s now possible, and the most rewarding work you’ll ever do.#sxsw #usds", "title": "9 days until SXSW Interactive: White House tech wiz Mikey Dickerson joins @pahlkadot on March 16 to ..."}, {"content": "I like +Nancy Lublin's pineapple hack. #LeanInTogether", "title": "I like +Nancy Lublin's pineapple hack. #LeanInTogether"}, {"content": "There are two kinds of interviews: those that quote you literally, and those that distill the essence of what you said, perfectly. Chris O'Brien's @venturebeat interview with me did the latter, and nailed it.  Just about the only time I can think of a flawless transcript of what was meant rather than just what was said.", "title": "There are two kinds of interviews: those that quote you literally, and those that distill the essence..."}, {"content": "What a great read!  @neilhimself explains why our future depends on libraries, reading and daydreaming. I love the bit about China! And I am horrified by the bit about prisons.", "title": "What a great read!  @neilhimself explains why our future depends on libraries, reading and daydreaming..."}, {"content": "Help O'Reilly Media learn more about software architecture roles by completing a short industry survey. You could win a free pass to the new O'Reilly Software Architecture Conference in Boston next month. #OReillySACon", "title": "Help O'Reilly Media learn more about software architecture roles by completing a short industry survey..."}, {"content": "Just about to go on with Marc Goodman (@futurecrimes) for a discussion of his book Future Crimes starting in about 7 minutes, here: https://plus.google.com/events/c7lf0pdvsn6nb0qj3cibnu6othc  Join us!  It should be a fascinating conversation.", "title": "Just about to go on with Marc Goodman (@futurecrimes) for a discussion of his book Future Crimes starting..."}, {"content": "I'm going to be doing a google hangout this Thursday, February 26 at 1 pm Pacific, with Marc Goodman, author of the new book Future Crimes, talking about the remarkable underworld of the internet.Tweet your questions for the chat with the hashtag #FutureCrimesConvo, and start reading Future Crimes now: www.futurecrimes.com", "title": "I'm going to be doing a google hangout this Thursday, February 26 at 1 pm Pacific, with Marc Goodman..."}, {"content": "Really great career advice here: \"Getting off the “I should learn Python… someday” train and focusing on topics that interest me (rather than an arbitrary skill I thought I should learn) was extremely liberating.\"", "title": "Really great career advice here: \"Getting off the “I should learn Python… someday” train and focusing..."}, {"content": "Neville Chamberlin, Winston Churchill, and climate change. A good reminder to politicians about the importance of thinking about things that are hard to imagine.", "title": "Neville Chamberlin, Winston Churchill, and climate change. A good reminder to politicians about the ..."}, {"content": "Santa Fe sunset", "title": "Santa Fe sunset"}, {"content": "Absolutely fascinating exploration of the microbiome of a city.For those who don't know what the microbiome is, the article defines it with some interesting statistics:\"Typically, every person is home to about a hundred trillion microbial cells bearing five million different genes, totaling about 5 pounds of micro-organisms per person. Indeed, microbes in and on the body outnumber human cells about 10 to one.“You are a minority party in the democracy of the body,” Dr. Mason said.\"The body’s collection of microbes, called the microbiome, influences health in ways that researchers are only beginning to understand. They may be key to proper digestion, vitamin synthesis and brain function, new research suggests. Changes among the millions of microbes living in the human stomach also may promote obesity, trigger ulcers or affect how well a flu vaccine works.\"The article describes a research project to explore signs of this microbiome expressed on surfaces throughout the NYC subways.My two favorite quotes:“A city is like an organism,” said IBM Corp. computational biologist Robert Prill, who is among those at the company investigating ways to better collect and analyze these immense new public-health genome databases. “It has a circulating system consisting of the movement of people.”and“We know next to nothing about the ecology of urban environments,” said evolutionary biologist Jonathan Eisen at the University of California at Davis. “How will we know if there is something abnormal if we don’t know what normal is?”", "title": "Absolutely fascinating exploration of the microbiome of a city.\n\nFor those who don't know what the microbiome..."}, {"content": "Fascinating history of the lobbying campaign that took streets away from pedestrians and gave them to motorists.", "title": "Fascinating history of the lobbying campaign that took streets away from pedestrians and gave them to..."}, {"content": "Super-interesting. I am fascinated by the possibilities.", "title": "Super-interesting. I am fascinated by the possibilities."}, {"content": "The best definition of Freudian psychoanalysis I've ever seen, from poet W.H. Auden:\"...he merely toldthe unhappy Present to recite the Pastlike a poetry lesson till sooner or laterit faltered at the line wherelong ago the accusations had begun...\"Quoted in Richard Greene's introduction to the Collector's Library edition of Graham Greene's Ministry of Fear.(I found the book a bit odd, but compelling.)", "title": "The best definition of Freudian psychoanalysis I've ever seen, from poet W.H. Auden:\n\n\"...he merely ..."}, {"content": "Jen was singing Christmas carols as we skied down the mountain at sunset. Happiness!", "title": "Jen was singing Christmas carols as we skied down the mountain at sunset. Happiness!"}, {"content": "This piece about the \"everyone should learn to program\" meme is completely right on.  \"Learning to program for its own sake, rather than focused on a task the student wants to achieve, suffers from the problem of attracting only people who are already interested in programming.\" via +Mike Loukides ", "title": "This piece about the \"everyone should learn to program\" meme is completely right on.  \"Learning to program..."}, {"content": "This was my favorite piece in this Sunday's New York Times. It's a fascinating article about CBW, a tiny bank in Kansas, that has become a laboratory for financial innovation with a focus on better user experience.\"The creation of the new bank, and the maintenance of the old one, are the work of a couple who were born in India and ended up in Kansas after living in Silicon Valley and passing through jobs at Google and Lehman Brothers....\"Their work is an unusual experiment: a new kind of mom-and-pop business trying to reshape a highly regulated and innovation-resistant industry. The new services that CBW is providing, like instant payments to any bank in the United States, direct remittance transfers abroad and specialized debit cards, might seem as if they should be painless upgrades in an age of high-frequency trading and interplanetary space missions. But with most banks, it still takes longer to send money to another country or even to another state than it does to travel the same distance.\"I was particularly struck by this paragraph, which reminded me of the fundamental game plan that we practice on government with the Code for America Fellowship:\"As he and his wife had hoped, buying an established institution allowed them to examine how money transfers and payment technology worked in a traditional bank — something that was hard to see in detail from the outside — and to consider how to make changes.\"His first discovery was that nearly all banks rely on a few big, and not terribly agile, outside vendors to provide all the software that makes bank computer systems work. Mr. Ramamurthi found a small technology provider that would be more flexible and allow him to begin tweaking the software....\"Get inside, figure out how it works now. Then start to iterate towards change, making the institution more flexible, and able to meet real user needs.", "title": "This was my favorite piece in this Sunday's New York Times. It's a fascinating article about CBW, a ..."}, {"content": "When I was in Spain a few weeks ago, I was struck by how beautiful the cacti could be, limned in light.  A good reminder of the hot country for those us experiencing today's wet and windy California.", "title": "When I was in Spain a few weeks ago, I was struck by how beautiful the cacti could be, limned in light..."}, {"content": "Othermachines ready to ship.  This is the Macintosh of desktop manufacturing.", "title": "Othermachines ready to ship.  This is the Macintosh of desktop manufacturing."}, {"content": "Now on Medium--the Best of O'Reilly Radar: http://bit.ly/133U4wb  Our latest thinking on the big ideas we track. More coming soon.", "title": "Now on Medium--the Best of O'Reilly Radar: http://bit.ly/133U4wb  Our latest thinking on the big ideas..."}, {"content": "The view from the offices of Passport Capital at One Market. Amazing how much construction is happening in San Francisco!", "title": "The view from the offices of Passport Capital at One Market. Amazing how much construction is happening..."}, {"content": "I love the Howtoons mural at OtherLab's new SF headquarters!", "title": "I love the Howtoons mural at OtherLab's new SF headquarters!"}, {"content": "Last Cabo Pulmo sunset of this holiday. Spectacular!", "title": "Last Cabo Pulmo sunset of this holiday. Spectacular!"}, {"content": "The @OReillyMedia Cyber Monday Sale is on. Save 50-60% on over 10,000 ebooks and video training.", "title": "The @OReillyMedia Cyber Monday Sale is on. Save 50-60% on over 10,000 ebooks and video training."}, {"content": "Cabo Pulmo sunrise", "title": "Cabo Pulmo sunrise"}, {"content": "Cabo Pulmo sunrise", "title": "Cabo Pulmo sunrise"}, {"content": "If  told you that any K-12 student in the US can get full access to all O'Reilly books and videos via a free Safari subscription, you'd be looking for the catch.  There isn't one (except that it's only open to US students - sorry. If anyone has ideas about how we can validate young people in other countries, we can explore adding them. +Andrew Savikas explains how this came about. Congratulations to the Safari team, especially +Keith Fahlgren, who took the bit in his teeth and figured out how to make this happen.  I particularly like how the Safari team figured out how to make this an internet self-service play rather than something we had to work through bureaucratic channels.And thanks to the folks at the White House, who used their convening power to get a whole lot of donations to help kickstart better STEM education in America.", "title": "If  told you that any K-12 student in the US can get full access to all O'Reilly books and videos via..."}, {"content": "Inside La Sagrada Familia, Gaudi's \"Church of Harmonious Light.\"  The colors and shapes are astonishing.", "title": "Inside La Sagrada Familia, Gaudi's \"Church of Harmonious Light.\"  The colors and shapes are astonishing..."}, {"content": "I like Michael Lewis' latest piece, about how happiness comes more from giving than from getting more, and that that is a lesson that is most needed by the very  rich.  He discusses it in the context of personal happiness, but also with regard to politics:\"The grotesque inequality between the haves and the have-nots is seldom framed as a problem that the haves might privately help to resolve. Instead, it is a problem the have-nots must persuade their elected officials to do something about, presumably against the wishes of the haves.\"", "title": "I like Michael Lewis' latest piece, about how happiness comes more from giving than from getting more..."}, {"content": "Johnny McGuire, the owner of the wonderful Bricin restaurant in Killarney, told me how moved he was by this piece my brother James wrote many years ago about my dad and Ireland, so I found it for him and reread it myself, and then read it aloud to my family gathered at Bricin for dinner - my brothers James and Frank, my brother-in-law John Ciskanik and his son Johnny, James' daughter Mary, my mom, my Aunt Maureen and her friends Maureen and Paddy Chevins.It is a moving piece about the magic of Ireland.Incidentally, the painting of Torc Mountain referred to in the story was by Sean O'Connor.  We were eating dinner in a room filled with O'Connor's paintings, which is what led Johny McGuire to inquire about James' story.And if you've seen my photos from Killarney over the past couple of days, the distinctive shape of Torc can be seen in many of them.", "title": "Johnny McGuire, the owner of the wonderful Bricin restaurant in Killarney, told me how moved he was ..."}, {"content": "This piece about @jgrahamc's campaign to get the UK gov to apologize to Alan Turing shows why +Steven Levy's Backchannel on Medium is so great at telling the inside story of events and people that matter in tech. I am delighted that I was able to turn Steven on to John Graham Cumming's story, which demonstrates how a geek with a cause can use his skills to make a big difference.", "title": "This piece about @jgrahamc's campaign to get the UK gov to apologize to Alan Turing shows why +Steven..."}, {"content": "And here's a view of Loch Leine, from the same spot in Killarney.", "title": "And here's a view of Loch Leine, from the same spot in Killarney."}, {"content": "View of Torc, which rises over Muckross Lake, from atop a ruin in Killarney. Stunning!I grew up with a painting of Torc above my family's living room mantel, a reminder of where my father grew up.  He is now thirty years buried within view of that mountain.", "title": "View of Torc, which rises over Muckross Lake, from atop a ruin in Killarney. Stunning!\n\nI grew up with..."}, {"content": "Advice on speechwriting from my 80+ year old Irish aunt: \"Try to write a very good first line. And then try to write a very good last line. And then try to put them as close together as possible.\"  Love it!We were swapping stories about brevity. I shared Blaise Pascal's famous line, \"I have made this longer than usual because I have not had time to make it shorter\" and told the story I'd heard attributed to Woodrow Wilson.  When asked how long it took him to prepare for a five minute speech, he said \"About two weeks.\"  Astonished listener: \"Well, then, how long does it take you to prepare for an hour-long speech?\" Wilson:  \"Oh, I could do that right now.\"But I think she topped me with her anecdote, apparently from a priest who said it about his technique for writing sermons.", "title": "Advice on speechwriting from my 80+ year old Irish aunt: \"Try to write a very good first line. And then..."}, {"content": "At Bolton Abbey in Yorkshire, a compelling reminder that the beloved landscape of Yorkshire is fundamentally a human landscape, not a purely natural one.", "title": "At Bolton Abbey in Yorkshire, a compelling reminder that the beloved landscape of Yorkshire is fundamentally..."}, {"content": "Super exciting news for O'Reilly and Safari. Even more great technical training content coming soon!", "title": "Super exciting news for O'Reilly and Safari. Even more great technical training content coming soon!"}, {"content": "Here are the slides from my talk at the Web Summit in Dublin.", "title": "Here are the slides from my talk at the Web Summit in Dublin."}, {"content": "If you're interested about the emerging startup ecosystem around government transformation (a $172 Billion market in the US alone, ripe for improvement), come check out Code for America's Bay Area Government Technology Showcase.  If you're here in SF, you can attend in person. 6 pm tonight; tickets available below.  Otherwise, you can watch the live stream here: http://www.codeforamerica.org/companies/bay-area-government-technology-showcase/", "title": "If you're interested about the emerging startup ecosystem around government transformation (a $172 Billion..."}, {"content": "The programmable world is creating disruptive innovation as profound as the Internet . A good place to follow the revolution is the @OReillyMedia IoT+ newsletter, which will also keep you up to date on our amazing Solid conference", "title": "The programmable world is creating disruptive innovation as profound as the Internet . A good place ..."}, {"content": "Well worth reading.  Typical Kevin Kelly insight and level-headedness.", "title": "Well worth reading.  Typical Kevin Kelly insight and level-headedness."}, {"content": "Important piece about why the \"tradeoff\" between security and privacy will inevitably end badly...", "title": "Important piece about why the \"tradeoff\" between security and privacy will inevitably end badly..."}, {"content": "Every teacher in the modern world should read this piece, and do what the author did.", "title": "Every teacher in the modern world should read this piece, and do what the author did."}, {"content": "UN Draft report on the use of data for sustainable development. It's very good already, but they are looking for comment from people who know a lot about big data, and who care that it is used properly by government and NGOs to make a better world.(I was part of the group that worked on this report, though I played a very minor role in actually writing it.)", "title": "UN Draft report on the use of data for sustainable development. It's very good already, but they are..."}, {"content": "I have been really impressed by Howard Schultz of @starbucks. Really looking forward to his new book ", "title": "I have been really impressed by Howard Schultz of @starbucks. Really looking forward to his new book..."}, {"content": "The 10-year contract for the US recreation.gov site  is up for renewal, and the Department of the Interior had promised an RFP for a new contract that conformed with the open data mandate. If it were consistent with the Obama open data guidance, that RFP would require an API so that independent companies could provide alternate interfaces, just like travel sites provide booking interfaces for air travel, hotels, and more. Unfortunately, as drafted, the RFP allows the winning contractor to determine whether an API is feasible — meaning the company that benefits most from keeping all the reservations to itself  has the authority to do so. And the draft even removes data that is currently accessible — availability data — from public sharing. So, it’s a huge step backward, and completely out of step with the administration’s open data policy.The founder of Hipcamp, Alyssa Ravasio, has written up some thoughts on how this RFP could be improved that I want to share with you. And after reading them, I’m hoping you will be moved to send comments asking the Department of the Interior to reconsider their RFP.Comments on this draft are accepted via email to jasonmking@fs.fed.us through Wednesday October 22. Please send your comments.", "title": "The 10-year contract for the US recreation.gov site  is up for renewal, and the Department of the Interior..."}, {"content": "If you aren't planning to come to East Bay Mini Maker Faire in Oakland tomorrow, here are 170 reasons why you should!10 am to 5 pm at Park Day School in Oakland.  Tickets are still available:http://ebmakerfaire2014.eventbrite.com", "title": "If you aren't planning to come to East Bay Mini Maker Faire in Oakland tomorrow, here are 170 reasons..."}, {"content": "Fun tile work in bryant park subway station", "title": "Fun tile work in bryant park subway station"}, {"content": "October 30, at O'Reilly Media offices in Cambridge.  Docker seems to us to be one of the most important things in software development in a long time.  It's also very important to our future plans for including active content in our books.", "title": "October 30, at O'Reilly Media offices in Cambridge.  Docker seems to us to be one of the most important..."}, {"content": "It's a mob scene in the #strataconf exhibit hall.", "title": "It's a mob scene in the #strataconf exhibit hall."}, {"content": "My family includes vaccine deniers.  This one is for them, and for far too many others. Funny how fear works.  We're terrified of #Ebola (true, there are a lot of unknowns, and very high mortality if you get it), but tens of thousands die annually from the flu, 50 million died in the 1918 outbreak - and there is a vaccine that can help protect you.  I get mine every year. So should you.", "title": "My family includes vaccine deniers.  This one is for them, and for far too many others. Funny how fear..."}, {"content": "A sobering read, especially when you walk around cities and still see people washing their cars and sidewalks, watering their lawns (heck, overwatering their lawns), and generally acting like there is no drought.This article really brings it home.  The URL says it all:  \"Why the California Drought is All Your Fault\"", "title": "A sobering read, especially when you walk around cities and still see people washing their cars and ..."}, {"content": "It's wonderful to see the program shaping up for the East Bay Mini Maker Faire in Oakland next Sunday.  As I wrote recently on twitter, this is the Maker Faire that Goldilocks prefers:  Not too big. Not too small. Just right.You need a full weekend to get through one of the big Maker Faires properly.  This one you can enjoy in an afternoon (though you may find yourself wanting to stay the full day!)We had about 5000 people last year and over 170 Makers/Exhibitors/Performers, so come early!", "title": "It's wonderful to see the program shaping up for the East Bay Mini Maker Faire in Oakland next Sunday..."}, {"content": "Can We Use Data to Make Better Regulations?Evgeny Morozov either misunderstands or misrepresents the key point of my piece on Algorithmic Regulation.  In his recent New Yorker article about big data and regulation, he summarizes my view as \"collect as much relevant data from as many sources as possible, analyze them in real time, and make an optimal decision based on the current circumstances rather than on some idealized projection.\"In fact, my article is about building regulations that do a better job of achieving their  long term idealized outcome!  Morozov has  got it precisely backwards.Here's what I actually said on the subject.  The article opens:\"Regulation is the bugaboo of today’s politics. We have too much of it in most areas, we have too little of it in others, but mostly, we just have the wrong kind, a mountain of paper rules, inefficient processes, and little ability to adjust the rules or the processes when we discover the inevitable unintended results.\"Consider, for a moment, regulation in a broader context. Your car’s electronics regulate the fuel-air mix in the engine to find an optimal balance of fuel efficiency and minimal emissions. An airplane’s autopilot regulates the countless factors required to keep that plane aloft and heading in the right direction. Credit card companies monitor and regulate charges to detect fraud and keep you under your credit limit. Doctors regulate the dosage of the medicine they give us, sometimes loosely, sometimes with exquisite care, as with the chemotherapy required to kill cancer cells while keeping normal cells alive, or with the anesthesia that keeps us unconscious during surgery while keeping vital processes going. ISPs and corporate mail systems regulate the mail that reaches us, filtering out spam and malware to the best of their ability. Search engines regulate the results and advertisements they serve up to us, doing their best to give us more of what we want to see.\"What do all these forms of regulation have in common?\"A deep understanding of the desired outcome\"Real-time measurement to determine if that outcome is being achieved\"Algorithms (i.e. a set of rules) that make adjustments based on new data\"Periodic, deeper analysis of whether the algorithms themselves are correct and performing as expected.\"There are a few cases—all too few—in which governments and quasi-governmental agencies regulate using processes similar to those outlined above. Probably the best example is the way that central banks regulate the money supply in an attempt to manage interest rates, inflation, and the overall state of the economy. Surprisingly, while individual groups might prefer the US Federal Reserve to tighten or loosen the money supply at a different time or rate than they do, most accept the need for this kind of regulation.\"Why is this?\"The desired outcomes are clear\"There is regular measurement and reporting as to whether those outcomes are being achieved, based on data that is made public to everyone\"Adjustments are made when the desired outcomes are not being achieved\"Contrast this with the normal regulatory model, which focuses on the rules rather than the outcomes. How often have we faced rules that simply no longer make sense? How often do we see evidence that the rules are actually achieving the desired outcome?\"(http://beyondtransparency.org/chapters/part-5/open-data-and-algorithmic-regulation/).", "title": "Can We Use Data to Make Better Regulations?\n\nEvgeny Morozov either misunderstands or misrepresents the..."}, {"content": "Homework: An Unnecessary EvilAlfie Kohn's first footnote perfectly captures my feelings (although he doesn't argue those points.)  Most primary school homework is an abomination  As a parent, I constantly resented my kids' school telling us how we should spend our time, and then, even worse, making such terrible choices on how we should spend it.  As I've often noted to friends, my brothers and sisters who homeschooled their kids spent less time doing that than we spent just on homework, with equivalent results - kids who went on to college and successful lives.Something is very wrong.  Here Alfie Kohn explains that there is no correlation between time spent on homework and either test scores or grades.", "title": "Homework: An Unnecessary Evil\n\nAlfie Kohn's first footnote perfectly captures my feelings (although ..."}, {"content": "What is not to love?! “@edabot: Chocolate millennium falcon made w help from #othermill @othermill +Otherlab I would take an othermill over a 3D printer any day.", "title": "What is not to love?! “@edabot: Chocolate millennium falcon made w help from #othermill @othermill +..."}, {"content": "Marilynne Robinson's Gilead is one of my favorite books ever.  I have re-read some passages dozens of times, and keep a copy on my phone to savor periodically. So I was excited to see an interview with her in the Sunday New York Times. It wasn't as good as I hoped - authors rarely live up to their books - but it got better as it went along (read to the end!) and  there were a couple of gems:\"people are too poorly suited to life in the world for this to be the definitive human condition.\"Lovely.And she also quotes one of the many lovely lines from Gilead: \"It all means more than I can tell you. So you must not judge what I know by what I find words for.\"", "title": "Marilynne Robinson's Gilead is one of my favorite books ever.  I have re-read some passages dozens of..."}, {"content": "I'm bummed I had a conflict and couldn't be there for the moment!  Governor Jerry Brown endorses my friend +Libby Schaaf for Mayor of Oakland.  I a big Libby fan.  She's got practical common sense, a focus on implementation (which, as everyone in tech knows, often makes a bigger difference than the idea you start with), and a deep desire to  to drive decisions by working backwards from the needs of Oakland's citizens.", "title": "I'm bummed I had a conflict and couldn't be there for the moment!  Governor Jerry Brown endorses my ..."}, {"content": "Actually, I think this shot is better.", "title": "Actually, I think this shot is better."}, {"content": "The other morning, before speaking at a Google event at Cavallo Point, +Jen Pahlka and I went for a sunrise walk. Jen took this shot of me with the sunrise Golden Gate.", "title": "The other morning, before speaking at a Google event at Cavallo Point, +Jen Pahlka and I went for a ..."}, {"content": "Google's Atmosphere event livecast starts tomorrow morning at 8:45 am pacific.  I'll be there, along with +Urs Hölzle, +Sundar Pichai, +Ben Fried, +Jennifer Pahlka , +vivek wadhwa and many other fascinating speakers, exploring how the cloud and Google Apps are being put to work in leading corporations worldwide. Some of the sessions (including mine) are off the record, but most of them are part of the livestream, which also includes some fascinating breakouts. Register tonight so you can join right in tomorrow.", "title": "Google's Atmosphere event livecast starts tomorrow morning at 8:45 am pacific.  I'll be there, along..."}, {"content": "My latest blog post:  What Amazon, iTunes, and Uber Teach Us About Apple Pay.The post opens:\"Something’s been nagging at me about Apple Pay, and the hype about it.\"The Apple-Pay web page gushes: “Gone are the days of searching for your wallet. The wasted moments finding the right card. The swiping and waiting. Now payments happen with a single touch.”\"What’s wrong with this picture?\"It’s describing the digital facsimile of a process that is already on its way to becoming obsolete. But truly disruptive new services don’t just digitize the familiar. They do away with it.\"I never search for my wallet when I take an Uber. I never search for my wallet when I walk out of a restaurant that accepts Cover. I never search for my wallet when I buy something from Amazon. I don’t even search for my wallet when buying a song from iTunes — or, for that matter, an iPhone from an Apple Store....\"", "title": "My latest blog post:  What Amazon, iTunes, and Uber Teach Us About Apple Pay.\n\nThe post opens:\n\n\"Something’s..."}, {"content": "This is a really important piece about open data and platforms.", "title": "This is a really important piece about open data and platforms."}, {"content": "Work on sh-t that matters, aka Poo CampToday was the annual chicken coop poo cleanup. (The chickens roost over a wire frame, and the dung piles up underneath, with some cleanout doors so we can dig it out for the garden.)Clem took some Foo Camp t-shirts, and modded them with some paint so they read \"poo camp,\"  and turned the tent with wifi logo into a steaming pile.Then we set to work.  Jen dug out the accumulated droppings, while Clem made sure it was all extra fresh for the chickens (who will immediately befoul it again.)  I dug some aged manure into a garden bed, and then Jen put the fresher stuff into the compost pile.Jen poked fun at some of my popular slogans  by saying that this was \"Work on fecal matter\" or \"Create more droppings than Tim can capture\", while I riposted that it was better called \"Work on shit that matters.\"  +Nat Torkington , who saw Jen's tweet, suggested \"Work on stuff that splatters.\"  Marc Hedlund topped us all with \"our mission is spreading the fertilizer of aviators.\"  All in good fun, but it's also true that composting does matter!", "title": "Work on sh-t that matters, aka Poo Camp\n\nToday was the annual chicken coop poo cleanup. (The chickens..."}, {"content": "The Code for America Summit  #cfasummit  was an inspiring event. It's amazing to see how much energy, insight, and caring can be demonstrated by people who put their skills to work on hard and important problems. This is a world apart from the \"Bro\" culture of Silicon Valley. Rachel Myrow did a brief but excellent segment on the California Report that gives a bit of the flavor.  For more, visit cfasummit.org or codeforamerica.org.  I'll also post more of my personal highlights here.", "title": "The Code for America Summit #cfasummit  was an inspiring event. It's amazing to see how much energy,..."}, {"content": "Live for stream the #CfASummit starting at 2:30 pm PDT.@pahlkadot opens, talking about current @codeforamerica strategy and focus areas. #civictech #gov", "title": "Live for stream the #CfASummit starting at 2:30 pm PDT.@pahlkadot opens, talking about current @codeforamerica..."}, {"content": "Who will build the “god platform” for the Internet of Things?The idea that everyone will have a separate app to control each IoT device is clearly a non-starter. But so is the idea of a \"universal remote.\" So what will the platform be for interoperability in the smart home, smart car, and the smart body network?  We had a spirited debate on the O'Reilly Radar backchannel, which +Jon Bruner and +Jenn Webb  turned into a blog post, in which we handicap the various players.There was a lot of support for Apple as the winner; I argued for Google/Android. I am a huge fan of Google Now. It seems to me to be the most interesting thing happening in Silicon Valley today. It is getting smarter by leaps and bounds, and is pointing us towards a whole new way of interacting with computers.  The combination of Google Now voice control with a smart watch running Google Wear has been truly transformative for the way I interact with applications and devices.What I'm waiting for is a better \"user programming model.\"  Google Now or Siri plus IFTTT.  Speech brings us back to the command line, and the Unix Shell was the most powerful command line I've used. I loved how it seduced people into programming.  Anything could be a command, and you could combine them into new \"scripts\" (sentences if you will), that then could become first class verbs of their own.  It is the ideal model for the speech system of the future:  a constrained vocabulary to begin with, but ultimate customizability. Just like spoken and written language itself. Of course, I didn't say all that in the post below. But it's the thinking behind my handicapping Google way ahead of Apple in this horse race.", "title": "Who will build the “god platform” for the Internet of Things?\n\nThe idea that everyone will have a separate..."}, {"content": "Top of the new World Trade Center wreathed in clouds. From the 9/11 Memorial", "title": "Top of the new World Trade Center wreathed in clouds. From the 9/11 Memorial"}, {"content": "If we are going to transform government, we need both an inside game and an outside game. The inside game consists of brilliant technologists like Todd Park and Mikey Dickerson and Bryan Sivak and Marina Martin who have passed up lucrative private sector opportunities to work inside government at the Federal level.I'm also thinking of past and present Code for America partners at the city level. Jascha Franklin Hodge in Boston, Teresa Reno Webber in Louisville, Beth Niblock in Detroit, and Rick Cole,  Peter Marx, and Abhi Nemani in LA all come to mind. There are so many people in government who are hungry for new ways of doing things. They went into public service to make a difference, and they want help from private sector partners who are working with 21st century technology and business models.The outside game has largely consisted of nonprofits like Code for America and Datakind, but now increasingly we are seeing commercial companies who are bringing new ways of thinking to government projects. Venture capital adds welcome fuel to the mix.I am so excited to be working with +***** on this fund!", "title": "If we are going to transform government, we need both an inside game and an outside game.\n\nThe inside..."}, {"content": "Fascinating look at the role that various US billionaires play in politics. A quick look at what appears to be a deeper dive into the politics of top billionaires.  In this time when there is concern about money in politics, it helps to know who's buying whom :-(", "title": "Fascinating look at the role that various US billionaires play in politics. A quick look at what appears..."}, {"content": "ABC World News covers @HomeDepot credit card data breach, recommends @BillGuard to protect yourself! BillGuard on ABC World News Tonight With David Muir … (Minute 1:25)", "title": "ABC World News covers @HomeDepot credit card data breach, recommends @BillGuard to protect yourself!..."}, {"content": "This past weekend, I went up to DRNK Winery (drnkwines.com), the family partnership between Dale and Nancy Dougherty, their daughter Katie, and her husband Ryan Kunde. The winery name comes from their first names, in the proper order. Ryan is the winemaker, and a very good one, if I do say so myself.They were crushing Pinot Noir, and I helped on the sorting line. This photo set should give you a bit of the flavor of the day.", "title": "This past weekend, I went up to DRNK Winery (drnkwines.com), the family partnership between Dale and..."}, {"content": "I'm a huge fan of Dave Hickey, and this piece is well worth reading.", "title": "I'm a huge fan of Dave Hickey, and this piece is well worth reading."}, {"content": "Not entirely fair to Javascript, but funny:", "title": "Not entirely fair to Javascript, but funny:"}, {"content": "Beautiful trail runs from the slope of Mt. Tam down to the beach at Tennessee Valley. Fantastic views.  And fantastic company. Thanks, +Mark Brokering and +Allen Noren for a great hike and fun conversation.", "title": "Beautiful trail runs from the slope of Mt. Tam down to the beach at Tennessee Valley. Fantastic views..."}, {"content": "The title of this piece doesn't do it justice. The description does better: \"This talk discusses how logs and stream-processing can form a backbone for data flow, ETL, and real-time data processing. It describes the challenges and lessons learned as LinkedIn built out its real-time data subscription and processing infrastructure. It also discusses the role of real-time processing and its relationship to offline processing frameworks such as MapReduce.", "title": "The title of this piece doesn't do it justice. The description does better: \"This talk discusses how..."}, {"content": "I love Warren Buffet's \"punch card\" analogy. Applied here not just to investing but to live.", "title": "I love Warren Buffet's \"punch card\" analogy. Applied here not just to investing but to live."}, {"content": "It's amazing to me that CGI, the company that brought us the healthcare.gov fiasco, has the chutzpah to protest the ways that the UK GDS has cut the cost of government IT services while making those services far better for citizens. These guys should be laughed out of the room. The IT vendors need to work to improve their own services, not spread FUD about those who are showing how to do it better!", "title": "It's amazing to me that CGI, the company that brought us the healthcare.gov fiasco, has the chutzpah..."}, {"content": "Is anyone else having troubles with Bluetooth on a Moto X?  It connects fine to my car when I make a call, but the bluetooth drops in and out, and the phone prompts me to ask whether I want to use the speakerphone, the headset, or the bluetooth - but a few seconds later, it connects back to bluetooth.  And oddly, it only happens some of the time.  And other uses of Bluetooth from the phone - for example, playing an audiobook or music - demonstrate no similar behavior.It's a disastrous bug. Making me think about switching to another phone, even though I love this one.  And it seems to have been introduced only in the past month or so, as the phone worked fine with the car before that.And yes, I've tried forgetting and re-initiating the bluetooth connection.", "title": "Is anyone else having troubles with Bluetooth on a Moto X?  It connects fine to my car when I make a..."}, {"content": "I just did an hour video interview with +Slashdot. Here's what they had to say about it:\"We've run a few two-part videos, but this is the first time we've split one video into six parts -- with two running today, two tomorrow, and two Thursday. But then, how many people do we interview who have had as much of an effect on the nature of information transmission -- as opposed to just publishing -- as Tim O'Reilly? We don't know for sure, but there's a good chance that O'Reilly books are owned by more Slashdot readers than books from any other publisher. That alone makes Tim O'Reilly worth listening to for nearly an hour, total.\"", "title": "I just did an hour video interview with +Slashdot. Here's what they had to say about it:\n\n\"We've run..."}, {"content": "I find it distressing that US politicians (and the rest of world governments) can find hundreds of billions of dollars to make war, but only a pittance to build hospitals and other basic infrastructure, such that doctors have to flee for their lives when they are needed most.", "title": "I find it distressing that US politicians (and the rest of world governments) can find hundreds of billions..."}, {"content": "Howtoons is an amazing resource for anyone who wants to inspire the spirit of independence and investigation, and yes, #making, in their kids.Check out the new book!", "title": "Howtoons is an amazing resource for anyone who wants to inspire the spirit of independence and investigation..."}, {"content": "I love @planetlabs gallery of images of our planet! Daily imaging (rather than annual, or targeted) will be game changing. And I love Planet Labs approach to making this data available for noncommercial use.", "title": "I love @planetlabs gallery of images of our planet! Daily imaging (rather than annual, or targeted) ..."}, {"content": "This is a very cool demo by of musical programming from #OSCON. ", "title": "This is a very cool demo by of musical programming from #OSCON. "}, {"content": "I'm super excited to announce that O'Reilly has acquired the 50% of Safari Books Online that we didn't already own, and it is now a wholly owned O'Reilly subsidiary. Safari has built a powerful distribution platform over the years, and in the past few, has added a superb engineering team.  We are going to build some kick-ass stuff together.", "title": "I'm super excited to announce that O'Reilly has acquired the 50% of Safari Books Online that we didn't..."}, {"content": "An excellent demonstration of why Open Access lowers the barriers to knowledge-sharing in science. This is what scientific publishing is supposed to be about!", "title": "An excellent demonstration of why Open Access lowers the barriers to knowledge-sharing in science. This..."}, {"content": "Why Common Core is Like Healthcare.govDraw a bold line between this piece on the failure of the Common Core initiative to improve math education and the failure of healthcare.gov (even though the Common Core has nothing to do with IT): \"The inadequate implementation can make math reforms seem like the most absurd form of policy change.\"This is the sermon that +Mike Bracken and +Jennifer Pahlka have been preaching.  As Mike puts it, \"We don't have a policy crisis. We have a delivery crisis!\"  We endlessly promote new policies that are supposed to fix everything, but pay little attention to what it will take to actually implement them.In an In an interview with Charlie Rose, Steven Brill said something similar about the failure of healthcare.gov in the disconnect between policy and implementation: “The way they managed this program, it was almost as if they thought that actual governing, the nuts and bolts of governing, is for peons. And they are policy people.” (See http://linkd.in/1o0RSOj)In this particular case, there is little or no teacher training, no supervision: \"The trouble always starts when teachers are told to put innovative ideas into practice without much guidance on how to do it. In the hands of unprepared teachers, the reforms turn to nonsense, perplexing students more than helping them....\"\"With the Common Core, teachers are once more being asked to unlearn an old approach and learn an entirely new one, essentially on their own. Training is still weak and infrequent, and principals — who are no more skilled at math than their teachers — remain unprepared to offer support. Textbooks, once again, have received only surface adjustments, despite the shiny Common Core labels that decorate their covers.\"By contrast, Japan took not just the ideas of how to teach math better, but also put those ideas carefully and thoroughly into practice.  \"In Japan, teachers had always depended on jugyokenkyu, which translates literally as “lesson study,” a set of practices that Japanese teachers use to hone their craft. A teacher first plans lessons, then teaches in front of an audience of students and other teachers along with at least one university observer. Then the observers talk with the teacher about what has just taken place. Each public lesson poses a hypothesis, a new idea about how to help children learn. And each discussion offers a chance to determine whether it worked. Without jugyokenkyu, it was no wonder the American teachers’ work fell short of the model set by their best thinkers. Without jugyokenyku, Takahashi never would have learned to teach at all. Neither, certainly, would the rest of Japan’s teachers.\"This is a must-read piece if you care about education, or even just, if like many parents, you are struggling to help your own children make up for the terrible math education they are getting in school.", "title": "Why Common Core is Like Healthcare.gov\n\nDraw a bold line between this piece on the failure of the Common..."}, {"content": "Stories like this make me ashamed to be a US citizen.  We are abdicating our responsibility as citizens as long as we allow our government - the one institution that is designed to look out for everyone equally - to outsource key functions to for-profit companies, and then look away as they use their position to abuse the powerless!", "title": "Stories like this make me ashamed to be a US citizen.  We are abdicating our responsibility as citizens..."}, {"content": "Back now from a wonderful holiday in Ireland.  It included a \"Hawk Walk\" in Killarney with Killarney Falconry.  At the end, we had this picture with a hunting owl.  (He only hunts at night, but he takes pictures during the day :-)", "title": "Back now from a wonderful holiday in Ireland.  It included a \"Hawk Walk\" in Killarney with Killarney..."}, {"content": "Kurdish vs Palestinian Strategies for IndependenceThis article makes a really good point, contrasting the Kurds with the Palestinians:\"This is what Barham Salih, the former prime minister of the Kurdistan Regional Government, told me years ago: “Compare us to other liberation movements around the world. We are very mature. We don’t engage in terror. We don’t condone extremist nationalist notions that can only burden our people. Please compare what we have achieved in the Kurdistan national-authority areas to the Palestinian national authority. … We have spent the last 10 years building a secular, democratic society, a civil society.” What, he asked, have the Palestinians built?\"", "title": "Kurdish vs Palestinian Strategies for Independence\n\nThis article makes a really good point, contrasting..."}, {"content": "It's almost fireworks time in Tulsa!", "title": "It's almost fireworks time in Tulsa!"}, {"content": "+Lawrence Lessig's MayDay PAC, a crowdfunded super PAC to end the influence of big money in politics, is closing in on $4 million of its $5 million target.Help get it over the finish line! This is really important. Pledge now", "title": "+Lawrence Lessig's MayDay PAC, a crowdfunded super PAC to end the influence of big money in politics..."}, {"content": "Fundraiser for Libby Schaaf for Mayor of Oakland at the BlueSprout industrial co working space. Oakland is a Maker city. Libby will be a Maker - friendly mayor. But she is most of all a doer who will help city government to work for its citizens!", "title": "Fundraiser for Libby Schaaf for Mayor of Oakland at the BlueSprout industrial co working space. Oakland..."}, {"content": " +Maria Konnikova's NY Times article about the role of time and attention scarcity in the cycle of poverty was arresting and important. It really echoed some of the issues that we've seen at +Code for America - there's a section at the end of the article that is going to be quoted often by people involved in the business of improving government services:\"If poverty is about time and mental bandwidth as well as money, how does this change how we combat its effects? 'When we think about programs for the poor, we don’t ever think, hey, let’s give them programs that don’t use a lot of bandwidth,' says Mr. Mullainathan. Instead, we fault people for failing to sign up for programs that are ostensibly available, even though we don’t factor in the time and cognitive capacity they need to get past even the first step.“'If I give people a very complicated form, it’s a big demand on cognitive capacity,' Mr. Shafir says. 'Take something like the Fafsa' — the Free Application for Federal Student Aid — 'Why is pickup for the low-income families less than 30 percent? People are already overwhelmed, and you go and give them an incredibly complicated form.'\"To him, the obvious conclusion is to radically change our thinking. 'Just like you wouldn’t charge them $1,000 to fill out a form, you shouldn’t charge them $1,000 in cognitive complexity,' he says. One study found that if you offer help with filling out the Fafsa form, pickup goes up significantly.\"It starts with empathyJake Solomon has another take on the issue, which he explains so well in his post People, Not Data https://medium.com/@lippytak/people-not-data-47434acb50a8 about the work he and the other Code for America fellows in San Francisco did last year to simplify the compliance for Food Stamp recipients.  What I love about Maria's article, though, is that it gives another way of thinking about why complex government forms are even worse than they appear, especially when it comes to providing services to people least able to deal with them.", "title": " +Maria Konnikova's NY Times article about the role of time and attention scarcity in the cycle of poverty..."}]